Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xf03 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x79f6f): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x62615): ../Core/Src/LCD.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x18e5b): C:/Users/gaming/STM32CubeIDE/workspace_1.5.0/stm32/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x6fd6d): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x28b35): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0x1d1aa): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0x69686): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0x7326e): __uint16_t
    <4f>   DW_AT_decl_file   : 2
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x86db2): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x5683d): __int32_t
    <62>   DW_AT_decl_file   : 2
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0xbae2): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x59b10): __uint32_t
    <75>   DW_AT_decl_file   : 2
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x2b2a5): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x4028c): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0x1da38): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0xb5a1): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x28b37): uint8_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 5 (DW_TAG_const_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x670bd): uint16_t
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 36
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x4a>
 <1><bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bd>   DW_AT_name        : (indirect string, offset: 0x5683f): int32_t
    <c1>   DW_AT_decl_file   : 3
    <c2>   DW_AT_decl_line   : 44
    <c3>   DW_AT_decl_column : 19
    <c4>   DW_AT_type        : <0x5d>
 <1><c8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c9>   DW_AT_type        : <0xbc>
 <1><cd>: Abbrev Number: 3 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x6694e): uint32_t
    <d2>   DW_AT_decl_file   : 3
    <d3>   DW_AT_decl_line   : 48
    <d4>   DW_AT_decl_column : 20
    <d5>   DW_AT_type        : <0x70>
 <1><d9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <da>   DW_AT_type        : <0xcd>
 <1><de>: Abbrev Number: 5 (DW_TAG_const_type)
    <df>   DW_AT_type        : <0xd9>
 <1><e3>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e4>   DW_AT_byte_size   : 16
    <e5>   DW_AT_decl_file   : 4
    <e6>   DW_AT_decl_line   : 759
    <e8>   DW_AT_decl_column : 9
    <e9>   DW_AT_sibling     : <0x126>
 <2><ed>: Abbrev Number: 8 (DW_TAG_member)
    <ee>   DW_AT_name        : (indirect string, offset: 0x4daf7): CTRL
    <f2>   DW_AT_decl_file   : 4
    <f3>   DW_AT_decl_line   : 761
    <f5>   DW_AT_decl_column : 18
    <f6>   DW_AT_type        : <0xd9>
    <fa>   DW_AT_data_member_location: 0
 <2><fb>: Abbrev Number: 8 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x4e5b0): LOAD
    <100>   DW_AT_decl_file   : 4
    <101>   DW_AT_decl_line   : 762
    <103>   DW_AT_decl_column : 18
    <104>   DW_AT_type        : <0xd9>
    <108>   DW_AT_data_member_location: 4
 <2><109>: Abbrev Number: 9 (DW_TAG_member)
    <10a>   DW_AT_name        : VAL
    <10e>   DW_AT_decl_file   : 4
    <10f>   DW_AT_decl_line   : 763
    <111>   DW_AT_decl_column : 18
    <112>   DW_AT_type        : <0xd9>
    <116>   DW_AT_data_member_location: 8
 <2><117>: Abbrev Number: 8 (DW_TAG_member)
    <118>   DW_AT_name        : (indirect string, offset: 0x2efdf): CALIB
    <11c>   DW_AT_decl_file   : 4
    <11d>   DW_AT_decl_line   : 764
    <11f>   DW_AT_decl_column : 18
    <120>   DW_AT_type        : <0xde>
    <124>   DW_AT_data_member_location: 12
 <2><125>: Abbrev Number: 0
 <1><126>: Abbrev Number: 10 (DW_TAG_typedef)
    <127>   DW_AT_name        : (indirect string, offset: 0x20aa6): SysTick_Type
    <12b>   DW_AT_decl_file   : 4
    <12c>   DW_AT_decl_line   : 765
    <12e>   DW_AT_decl_column : 3
    <12f>   DW_AT_type        : <0xe3>
 <1><133>: Abbrev Number: 11 (DW_TAG_variable)
    <134>   DW_AT_name        : (indirect string, offset: 0x2f94): ITM_RxBuffer
    <138>   DW_AT_decl_file   : 4
    <139>   DW_AT_decl_line   : 2052
    <13b>   DW_AT_decl_column : 25
    <13c>   DW_AT_type        : <0xc8>
    <140>   DW_AT_external    : 1
    <140>   DW_AT_declaration : 1
 <1><140>: Abbrev Number: 12 (DW_TAG_variable)
    <141>   DW_AT_name        : (indirect string, offset: 0x4320): SystemCoreClock
    <145>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 74
    <147>   DW_AT_decl_column : 17
    <148>   DW_AT_type        : <0xcd>
    <14c>   DW_AT_external    : 1
    <14c>   DW_AT_declaration : 1
 <1><14c>: Abbrev Number: 13 (DW_TAG_array_type)
    <14d>   DW_AT_type        : <0xab>
    <151>   DW_AT_sibling     : <0x15c>
 <2><155>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <156>   DW_AT_type        : <0x98>
    <15a>   DW_AT_upper_bound : 15
 <2><15b>: Abbrev Number: 0
 <1><15c>: Abbrev Number: 5 (DW_TAG_const_type)
    <15d>   DW_AT_type        : <0x14c>
 <1><161>: Abbrev Number: 12 (DW_TAG_variable)
    <162>   DW_AT_name        : (indirect string, offset: 0x801ac): AHBPrescTable
    <166>   DW_AT_decl_file   : 5
    <167>   DW_AT_decl_line   : 76
    <168>   DW_AT_decl_column : 23
    <169>   DW_AT_type        : <0x15c>
    <16d>   DW_AT_external    : 1
    <16d>   DW_AT_declaration : 1
 <1><16d>: Abbrev Number: 13 (DW_TAG_array_type)
    <16e>   DW_AT_type        : <0xab>
    <172>   DW_AT_sibling     : <0x17d>
 <2><176>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <177>   DW_AT_type        : <0x98>
    <17b>   DW_AT_upper_bound : 7
 <2><17c>: Abbrev Number: 0
 <1><17d>: Abbrev Number: 5 (DW_TAG_const_type)
    <17e>   DW_AT_type        : <0x16d>
 <1><182>: Abbrev Number: 12 (DW_TAG_variable)
    <183>   DW_AT_name        : (indirect string, offset: 0x30f52): APBPrescTable
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 77
    <189>   DW_AT_decl_column : 23
    <18a>   DW_AT_type        : <0x17d>
    <18e>   DW_AT_external    : 1
    <18e>   DW_AT_declaration : 1
 <1><18e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <18f>   DW_AT_byte_size   : 40
    <190>   DW_AT_decl_file   : 6
    <191>   DW_AT_decl_line   : 266
    <193>   DW_AT_decl_column : 9
    <194>   DW_AT_sibling     : <0x217>
 <2><198>: Abbrev Number: 8 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x10b7): MODER
    <19d>   DW_AT_decl_file   : 6
    <19e>   DW_AT_decl_line   : 268
    <1a0>   DW_AT_decl_column : 17
    <1a1>   DW_AT_type        : <0xd9>
    <1a5>   DW_AT_data_member_location: 0
 <2><1a6>: Abbrev Number: 8 (DW_TAG_member)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x6d3fd): OTYPER
    <1ab>   DW_AT_decl_file   : 6
    <1ac>   DW_AT_decl_line   : 269
    <1ae>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xd9>
    <1b3>   DW_AT_data_member_location: 4
 <2><1b4>: Abbrev Number: 8 (DW_TAG_member)
    <1b5>   DW_AT_name        : (indirect string, offset: 0x7a6a2): OSPEEDR
    <1b9>   DW_AT_decl_file   : 6
    <1ba>   DW_AT_decl_line   : 270
    <1bc>   DW_AT_decl_column : 17
    <1bd>   DW_AT_type        : <0xd9>
    <1c1>   DW_AT_data_member_location: 8
 <2><1c2>: Abbrev Number: 8 (DW_TAG_member)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x19eec): PUPDR
    <1c7>   DW_AT_decl_file   : 6
    <1c8>   DW_AT_decl_line   : 271
    <1ca>   DW_AT_decl_column : 17
    <1cb>   DW_AT_type        : <0xd9>
    <1cf>   DW_AT_data_member_location: 12
 <2><1d0>: Abbrev Number: 9 (DW_TAG_member)
    <1d1>   DW_AT_name        : IDR
    <1d5>   DW_AT_decl_file   : 6
    <1d6>   DW_AT_decl_line   : 272
    <1d8>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xd9>
    <1dd>   DW_AT_data_member_location: 16
 <2><1de>: Abbrev Number: 9 (DW_TAG_member)
    <1df>   DW_AT_name        : ODR
    <1e3>   DW_AT_decl_file   : 6
    <1e4>   DW_AT_decl_line   : 273
    <1e6>   DW_AT_decl_column : 17
    <1e7>   DW_AT_type        : <0xd9>
    <1eb>   DW_AT_data_member_location: 20
 <2><1ec>: Abbrev Number: 8 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x1ff86): BSRR
    <1f1>   DW_AT_decl_file   : 6
    <1f2>   DW_AT_decl_line   : 274
    <1f4>   DW_AT_decl_column : 17
    <1f5>   DW_AT_type        : <0xd9>
    <1f9>   DW_AT_data_member_location: 24
 <2><1fa>: Abbrev Number: 8 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x788dc): LCKR
    <1ff>   DW_AT_decl_file   : 6
    <200>   DW_AT_decl_line   : 275
    <202>   DW_AT_decl_column : 17
    <203>   DW_AT_type        : <0xd9>
    <207>   DW_AT_data_member_location: 28
 <2><208>: Abbrev Number: 9 (DW_TAG_member)
    <209>   DW_AT_name        : AFR
    <20d>   DW_AT_decl_file   : 6
    <20e>   DW_AT_decl_line   : 276
    <210>   DW_AT_decl_column : 17
    <211>   DW_AT_type        : <0x227>
    <215>   DW_AT_data_member_location: 32
 <2><216>: Abbrev Number: 0
 <1><217>: Abbrev Number: 13 (DW_TAG_array_type)
    <218>   DW_AT_type        : <0xd9>
    <21c>   DW_AT_sibling     : <0x227>
 <2><220>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <221>   DW_AT_type        : <0x98>
    <225>   DW_AT_upper_bound : 1
 <2><226>: Abbrev Number: 0
 <1><227>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <228>   DW_AT_type        : <0x217>
 <1><22c>: Abbrev Number: 10 (DW_TAG_typedef)
    <22d>   DW_AT_name        : (indirect string, offset: 0x88c23): GPIO_TypeDef
    <231>   DW_AT_decl_file   : 6
    <232>   DW_AT_decl_line   : 277
    <234>   DW_AT_decl_column : 3
    <235>   DW_AT_type        : <0x18e>
 <1><239>: Abbrev Number: 2 (DW_TAG_base_type)
    <23a>   DW_AT_byte_size   : 8
    <23b>   DW_AT_encoding    : 4	(float)
    <23c>   DW_AT_name        : (indirect string, offset: 0x73c43): long double
 <1><240>: Abbrev Number: 15 (DW_TAG_structure_type)
    <241>   DW_AT_byte_size   : 20
    <242>   DW_AT_decl_file   : 7
    <243>   DW_AT_decl_line   : 47
    <244>   DW_AT_decl_column : 9
    <245>   DW_AT_sibling     : <0x28b>
 <2><249>: Abbrev Number: 16 (DW_TAG_member)
    <24a>   DW_AT_name        : Pin
    <24e>   DW_AT_decl_file   : 7
    <24f>   DW_AT_decl_line   : 49
    <250>   DW_AT_decl_column : 12
    <251>   DW_AT_type        : <0xcd>
    <255>   DW_AT_data_member_location: 0
 <2><256>: Abbrev Number: 17 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x91da7): Mode
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 52
    <25d>   DW_AT_decl_column : 12
    <25e>   DW_AT_type        : <0xcd>
    <262>   DW_AT_data_member_location: 4
 <2><263>: Abbrev Number: 17 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x48cac): Pull
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 55
    <26a>   DW_AT_decl_column : 12
    <26b>   DW_AT_type        : <0xcd>
    <26f>   DW_AT_data_member_location: 8
 <2><270>: Abbrev Number: 17 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x52ce1): Speed
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 58
    <277>   DW_AT_decl_column : 12
    <278>   DW_AT_type        : <0xcd>
    <27c>   DW_AT_data_member_location: 12
 <2><27d>: Abbrev Number: 17 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0x407a0): Alternate
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 61
    <284>   DW_AT_decl_column : 12
    <285>   DW_AT_type        : <0xcd>
    <289>   DW_AT_data_member_location: 16
 <2><28a>: Abbrev Number: 0
 <1><28b>: Abbrev Number: 3 (DW_TAG_typedef)
    <28c>   DW_AT_name        : (indirect string, offset: 0x6e971): GPIO_InitTypeDef
    <290>   DW_AT_decl_file   : 7
    <291>   DW_AT_decl_line   : 63
    <292>   DW_AT_decl_column : 2
    <293>   DW_AT_type        : <0x240>
 <1><297>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <298>   DW_AT_encoding    : 7	(unsigned)
    <299>   DW_AT_byte_size   : 1
    <29a>   DW_AT_type        : <0x3c>
    <29e>   DW_AT_decl_file   : 7
    <29f>   DW_AT_decl_line   : 69
    <2a0>   DW_AT_decl_column : 1
    <2a1>   DW_AT_sibling     : <0x2b2>
 <2><2a5>: Abbrev Number: 19 (DW_TAG_enumerator)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x1d784): GPIO_PIN_RESET
    <2aa>   DW_AT_const_value : 0
 <2><2ab>: Abbrev Number: 19 (DW_TAG_enumerator)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x1962f): GPIO_PIN_SET
    <2b0>   DW_AT_const_value : 1
 <2><2b1>: Abbrev Number: 0
 <1><2b2>: Abbrev Number: 3 (DW_TAG_typedef)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x8a89e): GPIO_PinState
    <2b7>   DW_AT_decl_file   : 7
    <2b8>   DW_AT_decl_line   : 72
    <2b9>   DW_AT_decl_column : 2
    <2ba>   DW_AT_type        : <0x297>
 <1><2be>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <2bf>   DW_AT_prototyped  : 1
 <1><2bf>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <2c0>   DW_AT_byte_size   : 4
    <2c1>   DW_AT_type        : <0x2be>
 <1><2c5>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <2c6>   DW_AT_byte_size   : 4
 <1><2c7>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <2c8>   DW_AT_byte_size   : 4
    <2c9>   DW_AT_type        : <0x9f>
 <1><2cd>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <2ce>   DW_AT_encoding    : 7	(unsigned)
    <2cf>   DW_AT_byte_size   : 1
    <2d0>   DW_AT_type        : <0x3c>
    <2d4>   DW_AT_decl_file   : 8
    <2d5>   DW_AT_decl_line   : 51
    <2d6>   DW_AT_decl_column : 1
    <2d7>   DW_AT_sibling     : <0x2f4>
 <2><2db>: Abbrev Number: 19 (DW_TAG_enumerator)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x6c645): HAL_TICK_FREQ_10HZ
    <2e0>   DW_AT_const_value : 100
 <2><2e1>: Abbrev Number: 19 (DW_TAG_enumerator)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x33f1e): HAL_TICK_FREQ_100HZ
    <2e6>   DW_AT_const_value : 10
 <2><2e7>: Abbrev Number: 19 (DW_TAG_enumerator)
    <2e8>   DW_AT_name        : (indirect string, offset: 0x41d75): HAL_TICK_FREQ_1KHZ
    <2ec>   DW_AT_const_value : 1
 <2><2ed>: Abbrev Number: 19 (DW_TAG_enumerator)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x3216e): HAL_TICK_FREQ_DEFAULT
    <2f2>   DW_AT_const_value : 1
 <2><2f3>: Abbrev Number: 0
 <1><2f4>: Abbrev Number: 3 (DW_TAG_typedef)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x717c5): HAL_TickFreqTypeDef
    <2f9>   DW_AT_decl_file   : 8
    <2fa>   DW_AT_decl_line   : 56
    <2fb>   DW_AT_decl_column : 3
    <2fc>   DW_AT_type        : <0x2cd>
 <1><300>: Abbrev Number: 12 (DW_TAG_variable)
    <301>   DW_AT_name        : (indirect string, offset: 0x20c98): uwTick
    <305>   DW_AT_decl_file   : 8
    <306>   DW_AT_decl_line   : 205
    <307>   DW_AT_decl_column : 22
    <308>   DW_AT_type        : <0xd9>
    <30c>   DW_AT_external    : 1
    <30c>   DW_AT_declaration : 1
 <1><30c>: Abbrev Number: 12 (DW_TAG_variable)
    <30d>   DW_AT_name        : (indirect string, offset: 0x5a232): uwTickPrio
    <311>   DW_AT_decl_file   : 8
    <312>   DW_AT_decl_line   : 206
    <313>   DW_AT_decl_column : 17
    <314>   DW_AT_type        : <0xcd>
    <318>   DW_AT_external    : 1
    <318>   DW_AT_declaration : 1
 <1><318>: Abbrev Number: 12 (DW_TAG_variable)
    <319>   DW_AT_name        : (indirect string, offset: 0x84a89): uwTickFreq
    <31d>   DW_AT_decl_file   : 8
    <31e>   DW_AT_decl_line   : 207
    <31f>   DW_AT_decl_column : 28
    <320>   DW_AT_type        : <0x2f4>
    <324>   DW_AT_external    : 1
    <324>   DW_AT_declaration : 1
 <1><324>: Abbrev Number: 10 (DW_TAG_typedef)
    <325>   DW_AT_name        : (indirect string, offset: 0x680b1): wint_t
    <329>   DW_AT_decl_file   : 9
    <32a>   DW_AT_decl_line   : 350
    <32c>   DW_AT_decl_column : 23
    <32d>   DW_AT_type        : <0x98>
 <1><331>: Abbrev Number: 3 (DW_TAG_typedef)
    <332>   DW_AT_name        : (indirect string, offset: 0x41509): _off_t
    <336>   DW_AT_decl_file   : 10
    <337>   DW_AT_decl_line   : 46
    <338>   DW_AT_decl_column : 14
    <339>   DW_AT_type        : <0x69>
 <1><33d>: Abbrev Number: 3 (DW_TAG_typedef)
    <33e>   DW_AT_name        : (indirect string, offset: 0x1f9bd): _fpos_t
    <342>   DW_AT_decl_file   : 10
    <343>   DW_AT_decl_line   : 116
    <344>   DW_AT_decl_column : 14
    <345>   DW_AT_type        : <0x69>
 <1><349>: Abbrev Number: 23 (DW_TAG_union_type)
    <34a>   DW_AT_byte_size   : 4
    <34b>   DW_AT_decl_file   : 10
    <34c>   DW_AT_decl_line   : 165
    <34d>   DW_AT_decl_column : 3
    <34e>   DW_AT_sibling     : <0x36b>
 <2><352>: Abbrev Number: 24 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0x84b7d): __wch
    <357>   DW_AT_decl_file   : 10
    <358>   DW_AT_decl_line   : 167
    <359>   DW_AT_decl_column : 12
    <35a>   DW_AT_type        : <0x324>
 <2><35e>: Abbrev Number: 24 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0x48c6e): __wchb
    <363>   DW_AT_decl_file   : 10
    <364>   DW_AT_decl_line   : 168
    <365>   DW_AT_decl_column : 19
    <366>   DW_AT_type        : <0x36b>
 <2><36a>: Abbrev Number: 0
 <1><36b>: Abbrev Number: 13 (DW_TAG_array_type)
    <36c>   DW_AT_type        : <0x3c>
    <370>   DW_AT_sibling     : <0x37b>
 <2><374>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <375>   DW_AT_type        : <0x98>
    <379>   DW_AT_upper_bound : 3
 <2><37a>: Abbrev Number: 0
 <1><37b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <37c>   DW_AT_byte_size   : 8
    <37d>   DW_AT_decl_file   : 10
    <37e>   DW_AT_decl_line   : 162
    <37f>   DW_AT_decl_column : 9
    <380>   DW_AT_sibling     : <0x39f>
 <2><384>: Abbrev Number: 17 (DW_TAG_member)
    <385>   DW_AT_name        : (indirect string, offset: 0x27904): __count
    <389>   DW_AT_decl_file   : 10
    <38a>   DW_AT_decl_line   : 164
    <38b>   DW_AT_decl_column : 7
    <38c>   DW_AT_type        : <0x91>
    <390>   DW_AT_data_member_location: 0
 <2><391>: Abbrev Number: 17 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0x511f3): __value
    <396>   DW_AT_decl_file   : 10
    <397>   DW_AT_decl_line   : 169
    <398>   DW_AT_decl_column : 5
    <399>   DW_AT_type        : <0x349>
    <39d>   DW_AT_data_member_location: 4
 <2><39e>: Abbrev Number: 0
 <1><39f>: Abbrev Number: 3 (DW_TAG_typedef)
    <3a0>   DW_AT_name        : (indirect string, offset: 0x49fe6): _mbstate_t
    <3a4>   DW_AT_decl_file   : 10
    <3a5>   DW_AT_decl_line   : 170
    <3a6>   DW_AT_decl_column : 3
    <3a7>   DW_AT_type        : <0x37b>
 <1><3ab>: Abbrev Number: 3 (DW_TAG_typedef)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x4c82a): __ULong
    <3b0>   DW_AT_decl_file   : 11
    <3b1>   DW_AT_decl_line   : 22
    <3b2>   DW_AT_decl_column : 25
    <3b3>   DW_AT_type        : <0x7c>
 <1><3b7>: Abbrev Number: 3 (DW_TAG_typedef)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x4e8e5): _LOCK_T
    <3bc>   DW_AT_decl_file   : 12
    <3bd>   DW_AT_decl_line   : 34
    <3be>   DW_AT_decl_column : 25
    <3bf>   DW_AT_type        : <0x3c3>
 <1><3c3>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <3c4>   DW_AT_byte_size   : 4
    <3c5>   DW_AT_type        : <0x3c9>
 <1><3c9>: Abbrev Number: 25 (DW_TAG_structure_type)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x2b522): __lock
    <3ce>   DW_AT_declaration : 1
 <1><3ce>: Abbrev Number: 3 (DW_TAG_typedef)
    <3cf>   DW_AT_name        : (indirect string, offset: 0x45b54): _flock_t
    <3d3>   DW_AT_decl_file   : 11
    <3d4>   DW_AT_decl_line   : 35
    <3d5>   DW_AT_decl_column : 27
    <3d6>   DW_AT_type        : <0x3b7>
 <1><3da>: Abbrev Number: 26 (DW_TAG_structure_type)
    <3db>   DW_AT_name        : (indirect string, offset: 0x30b87): _Bigint
    <3df>   DW_AT_byte_size   : 24
    <3e0>   DW_AT_decl_file   : 11
    <3e1>   DW_AT_decl_line   : 52
    <3e2>   DW_AT_decl_column : 8
    <3e3>   DW_AT_sibling     : <0x434>
 <2><3e7>: Abbrev Number: 17 (DW_TAG_member)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x53e75): _next
    <3ec>   DW_AT_decl_file   : 11
    <3ed>   DW_AT_decl_line   : 54
    <3ee>   DW_AT_decl_column : 19
    <3ef>   DW_AT_type        : <0x434>
    <3f3>   DW_AT_data_member_location: 0
 <2><3f4>: Abbrev Number: 16 (DW_TAG_member)
    <3f5>   DW_AT_name        : _k
    <3f8>   DW_AT_decl_file   : 11
    <3f9>   DW_AT_decl_line   : 55
    <3fa>   DW_AT_decl_column : 7
    <3fb>   DW_AT_type        : <0x91>
    <3ff>   DW_AT_data_member_location: 4
 <2><400>: Abbrev Number: 17 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0x650b5): _maxwds
    <405>   DW_AT_decl_file   : 11
    <406>   DW_AT_decl_line   : 55
    <407>   DW_AT_decl_column : 11
    <408>   DW_AT_type        : <0x91>
    <40c>   DW_AT_data_member_location: 8
 <2><40d>: Abbrev Number: 17 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x4b41e): _sign
    <412>   DW_AT_decl_file   : 11
    <413>   DW_AT_decl_line   : 55
    <414>   DW_AT_decl_column : 20
    <415>   DW_AT_type        : <0x91>
    <419>   DW_AT_data_member_location: 12
 <2><41a>: Abbrev Number: 17 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x4afc7): _wds
    <41f>   DW_AT_decl_file   : 11
    <420>   DW_AT_decl_line   : 55
    <421>   DW_AT_decl_column : 27
    <422>   DW_AT_type        : <0x91>
    <426>   DW_AT_data_member_location: 16
 <2><427>: Abbrev Number: 16 (DW_TAG_member)
    <428>   DW_AT_name        : _x
    <42b>   DW_AT_decl_file   : 11
    <42c>   DW_AT_decl_line   : 56
    <42d>   DW_AT_decl_column : 11
    <42e>   DW_AT_type        : <0x43a>
    <432>   DW_AT_data_member_location: 20
 <2><433>: Abbrev Number: 0
 <1><434>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <435>   DW_AT_byte_size   : 4
    <436>   DW_AT_type        : <0x3da>
 <1><43a>: Abbrev Number: 13 (DW_TAG_array_type)
    <43b>   DW_AT_type        : <0x3ab>
    <43f>   DW_AT_sibling     : <0x44a>
 <2><443>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <444>   DW_AT_type        : <0x98>
    <448>   DW_AT_upper_bound : 0
 <2><449>: Abbrev Number: 0
 <1><44a>: Abbrev Number: 26 (DW_TAG_structure_type)
    <44b>   DW_AT_name        : (indirect string, offset: 0x2680b): __tm
    <44f>   DW_AT_byte_size   : 36
    <450>   DW_AT_decl_file   : 11
    <451>   DW_AT_decl_line   : 60
    <452>   DW_AT_decl_column : 8
    <453>   DW_AT_sibling     : <0x4cd>
 <2><457>: Abbrev Number: 17 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x7377e): __tm_sec
    <45c>   DW_AT_decl_file   : 11
    <45d>   DW_AT_decl_line   : 62
    <45e>   DW_AT_decl_column : 9
    <45f>   DW_AT_type        : <0x91>
    <463>   DW_AT_data_member_location: 0
 <2><464>: Abbrev Number: 17 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0xa69): __tm_min
    <469>   DW_AT_decl_file   : 11
    <46a>   DW_AT_decl_line   : 63
    <46b>   DW_AT_decl_column : 9
    <46c>   DW_AT_type        : <0x91>
    <470>   DW_AT_data_member_location: 4
 <2><471>: Abbrev Number: 17 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x1e59f): __tm_hour
    <476>   DW_AT_decl_file   : 11
    <477>   DW_AT_decl_line   : 64
    <478>   DW_AT_decl_column : 9
    <479>   DW_AT_type        : <0x91>
    <47d>   DW_AT_data_member_location: 8
 <2><47e>: Abbrev Number: 17 (DW_TAG_member)
    <47f>   DW_AT_name        : (indirect string, offset: 0x529de): __tm_mday
    <483>   DW_AT_decl_file   : 11
    <484>   DW_AT_decl_line   : 65
    <485>   DW_AT_decl_column : 9
    <486>   DW_AT_type        : <0x91>
    <48a>   DW_AT_data_member_location: 12
 <2><48b>: Abbrev Number: 17 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0x2604): __tm_mon
    <490>   DW_AT_decl_file   : 11
    <491>   DW_AT_decl_line   : 66
    <492>   DW_AT_decl_column : 9
    <493>   DW_AT_type        : <0x91>
    <497>   DW_AT_data_member_location: 16
 <2><498>: Abbrev Number: 17 (DW_TAG_member)
    <499>   DW_AT_name        : (indirect string, offset: 0x54527): __tm_year
    <49d>   DW_AT_decl_file   : 11
    <49e>   DW_AT_decl_line   : 67
    <49f>   DW_AT_decl_column : 9
    <4a0>   DW_AT_type        : <0x91>
    <4a4>   DW_AT_data_member_location: 20
 <2><4a5>: Abbrev Number: 17 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x3b04f): __tm_wday
    <4aa>   DW_AT_decl_file   : 11
    <4ab>   DW_AT_decl_line   : 68
    <4ac>   DW_AT_decl_column : 9
    <4ad>   DW_AT_type        : <0x91>
    <4b1>   DW_AT_data_member_location: 24
 <2><4b2>: Abbrev Number: 17 (DW_TAG_member)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x6fc10): __tm_yday
    <4b7>   DW_AT_decl_file   : 11
    <4b8>   DW_AT_decl_line   : 69
    <4b9>   DW_AT_decl_column : 9
    <4ba>   DW_AT_type        : <0x91>
    <4be>   DW_AT_data_member_location: 28
 <2><4bf>: Abbrev Number: 17 (DW_TAG_member)
    <4c0>   DW_AT_name        : (indirect string, offset: 0x7ed64): __tm_isdst
    <4c4>   DW_AT_decl_file   : 11
    <4c5>   DW_AT_decl_line   : 70
    <4c6>   DW_AT_decl_column : 9
    <4c7>   DW_AT_type        : <0x91>
    <4cb>   DW_AT_data_member_location: 32
 <2><4cc>: Abbrev Number: 0
 <1><4cd>: Abbrev Number: 27 (DW_TAG_structure_type)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x53393): _on_exit_args
    <4d2>   DW_AT_byte_size   : 264
    <4d4>   DW_AT_decl_file   : 11
    <4d5>   DW_AT_decl_line   : 79
    <4d6>   DW_AT_decl_column : 8
    <4d7>   DW_AT_sibling     : <0x512>
 <2><4db>: Abbrev Number: 17 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x7d71c): _fnargs
    <4e0>   DW_AT_decl_file   : 11
    <4e1>   DW_AT_decl_line   : 80
    <4e2>   DW_AT_decl_column : 10
    <4e3>   DW_AT_type        : <0x512>
    <4e7>   DW_AT_data_member_location: 0
 <2><4e8>: Abbrev Number: 17 (DW_TAG_member)
    <4e9>   DW_AT_name        : (indirect string, offset: 0x75b87): _dso_handle
    <4ed>   DW_AT_decl_file   : 11
    <4ee>   DW_AT_decl_line   : 81
    <4ef>   DW_AT_decl_column : 9
    <4f0>   DW_AT_type        : <0x512>
    <4f4>   DW_AT_data_member_location: 128
 <2><4f5>: Abbrev Number: 28 (DW_TAG_member)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x627f1): _fntypes
    <4fa>   DW_AT_decl_file   : 11
    <4fb>   DW_AT_decl_line   : 83
    <4fc>   DW_AT_decl_column : 10
    <4fd>   DW_AT_type        : <0x3ab>
    <501>   DW_AT_data_member_location: 256
 <2><503>: Abbrev Number: 28 (DW_TAG_member)
    <504>   DW_AT_name        : (indirect string, offset: 0x39b36): _is_cxa
    <508>   DW_AT_decl_file   : 11
    <509>   DW_AT_decl_line   : 86
    <50a>   DW_AT_decl_column : 10
    <50b>   DW_AT_type        : <0x3ab>
    <50f>   DW_AT_data_member_location: 260
 <2><511>: Abbrev Number: 0
 <1><512>: Abbrev Number: 13 (DW_TAG_array_type)
    <513>   DW_AT_type        : <0x2c5>
    <517>   DW_AT_sibling     : <0x522>
 <2><51b>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <51c>   DW_AT_type        : <0x98>
    <520>   DW_AT_upper_bound : 31
 <2><521>: Abbrev Number: 0
 <1><522>: Abbrev Number: 26 (DW_TAG_structure_type)
    <523>   DW_AT_name        : (indirect string, offset: 0x28a2): _atexit
    <527>   DW_AT_byte_size   : 140
    <528>   DW_AT_decl_file   : 11
    <529>   DW_AT_decl_line   : 90
    <52a>   DW_AT_decl_column : 8
    <52b>   DW_AT_sibling     : <0x564>
 <2><52f>: Abbrev Number: 17 (DW_TAG_member)
    <530>   DW_AT_name        : (indirect string, offset: 0x53e75): _next
    <534>   DW_AT_decl_file   : 11
    <535>   DW_AT_decl_line   : 91
    <536>   DW_AT_decl_column : 18
    <537>   DW_AT_type        : <0x564>
    <53b>   DW_AT_data_member_location: 0
 <2><53c>: Abbrev Number: 17 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x592c7): _ind
    <541>   DW_AT_decl_file   : 11
    <542>   DW_AT_decl_line   : 92
    <543>   DW_AT_decl_column : 6
    <544>   DW_AT_type        : <0x91>
    <548>   DW_AT_data_member_location: 4
 <2><549>: Abbrev Number: 17 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x1f76d): _fns
    <54e>   DW_AT_decl_file   : 11
    <54f>   DW_AT_decl_line   : 93
    <550>   DW_AT_decl_column : 9
    <551>   DW_AT_type        : <0x56a>
    <555>   DW_AT_data_member_location: 8
 <2><556>: Abbrev Number: 17 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x718c8): _on_exit_args_ptr
    <55b>   DW_AT_decl_file   : 11
    <55c>   DW_AT_decl_line   : 94
    <55d>   DW_AT_decl_column : 32
    <55e>   DW_AT_type        : <0x57a>
    <562>   DW_AT_data_member_location: 136
 <2><563>: Abbrev Number: 0
 <1><564>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <565>   DW_AT_byte_size   : 4
    <566>   DW_AT_type        : <0x522>
 <1><56a>: Abbrev Number: 13 (DW_TAG_array_type)
    <56b>   DW_AT_type        : <0x2bf>
    <56f>   DW_AT_sibling     : <0x57a>
 <2><573>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <574>   DW_AT_type        : <0x98>
    <578>   DW_AT_upper_bound : 31
 <2><579>: Abbrev Number: 0
 <1><57a>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <57b>   DW_AT_byte_size   : 4
    <57c>   DW_AT_type        : <0x4cd>
 <1><580>: Abbrev Number: 26 (DW_TAG_structure_type)
    <581>   DW_AT_name        : (indirect string, offset: 0x5e16c): __sbuf
    <585>   DW_AT_byte_size   : 8
    <586>   DW_AT_decl_file   : 11
    <587>   DW_AT_decl_line   : 122
    <588>   DW_AT_decl_column : 8
    <589>   DW_AT_sibling     : <0x5a8>
 <2><58d>: Abbrev Number: 17 (DW_TAG_member)
    <58e>   DW_AT_name        : (indirect string, offset: 0x8be2a): _base
    <592>   DW_AT_decl_file   : 11
    <593>   DW_AT_decl_line   : 123
    <594>   DW_AT_decl_column : 17
    <595>   DW_AT_type        : <0x5a8>
    <599>   DW_AT_data_member_location: 0
 <2><59a>: Abbrev Number: 17 (DW_TAG_member)
    <59b>   DW_AT_name        : (indirect string, offset: 0x8f142): _size
    <59f>   DW_AT_decl_file   : 11
    <5a0>   DW_AT_decl_line   : 124
    <5a1>   DW_AT_decl_column : 6
    <5a2>   DW_AT_type        : <0x91>
    <5a6>   DW_AT_data_member_location: 4
 <2><5a7>: Abbrev Number: 0
 <1><5a8>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <5a9>   DW_AT_byte_size   : 4
    <5aa>   DW_AT_type        : <0x3c>
 <1><5ae>: Abbrev Number: 26 (DW_TAG_structure_type)
    <5af>   DW_AT_name        : (indirect string, offset: 0x3105f): __sFILE_fake
    <5b3>   DW_AT_byte_size   : 32
    <5b4>   DW_AT_decl_file   : 11
    <5b5>   DW_AT_decl_line   : 158
    <5b6>   DW_AT_decl_column : 8
    <5b7>   DW_AT_sibling     : <0x621>
 <2><5bb>: Abbrev Number: 16 (DW_TAG_member)
    <5bc>   DW_AT_name        : _p
    <5bf>   DW_AT_decl_file   : 11
    <5c0>   DW_AT_decl_line   : 159
    <5c1>   DW_AT_decl_column : 18
    <5c2>   DW_AT_type        : <0x5a8>
    <5c6>   DW_AT_data_member_location: 0
 <2><5c7>: Abbrev Number: 16 (DW_TAG_member)
    <5c8>   DW_AT_name        : _r
    <5cb>   DW_AT_decl_file   : 11
    <5cc>   DW_AT_decl_line   : 160
    <5cd>   DW_AT_decl_column : 7
    <5ce>   DW_AT_type        : <0x91>
    <5d2>   DW_AT_data_member_location: 4
 <2><5d3>: Abbrev Number: 16 (DW_TAG_member)
    <5d4>   DW_AT_name        : _w
    <5d7>   DW_AT_decl_file   : 11
    <5d8>   DW_AT_decl_line   : 161
    <5d9>   DW_AT_decl_column : 7
    <5da>   DW_AT_type        : <0x91>
    <5de>   DW_AT_data_member_location: 8
 <2><5df>: Abbrev Number: 17 (DW_TAG_member)
    <5e0>   DW_AT_name        : (indirect string, offset: 0x402e7): _flags
    <5e4>   DW_AT_decl_file   : 11
    <5e5>   DW_AT_decl_line   : 162
    <5e6>   DW_AT_decl_column : 9
    <5e7>   DW_AT_type        : <0x43>
    <5eb>   DW_AT_data_member_location: 12
 <2><5ec>: Abbrev Number: 17 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0x1588d): _file
    <5f1>   DW_AT_decl_file   : 11
    <5f2>   DW_AT_decl_line   : 163
    <5f3>   DW_AT_decl_column : 9
    <5f4>   DW_AT_type        : <0x43>
    <5f8>   DW_AT_data_member_location: 14
 <2><5f9>: Abbrev Number: 16 (DW_TAG_member)
    <5fa>   DW_AT_name        : _bf
    <5fe>   DW_AT_decl_file   : 11
    <5ff>   DW_AT_decl_line   : 164
    <600>   DW_AT_decl_column : 17
    <601>   DW_AT_type        : <0x580>
    <605>   DW_AT_data_member_location: 16
 <2><606>: Abbrev Number: 17 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x40848): _lbfsize
    <60b>   DW_AT_decl_file   : 11
    <60c>   DW_AT_decl_line   : 165
    <60d>   DW_AT_decl_column : 7
    <60e>   DW_AT_type        : <0x91>
    <612>   DW_AT_data_member_location: 24
 <2><613>: Abbrev Number: 17 (DW_TAG_member)
    <614>   DW_AT_name        : (indirect string, offset: 0x9328a): _data
    <618>   DW_AT_decl_file   : 11
    <619>   DW_AT_decl_line   : 167
    <61a>   DW_AT_decl_column : 18
    <61b>   DW_AT_type        : <0x769>
    <61f>   DW_AT_data_member_location: 28
 <2><620>: Abbrev Number: 0
 <1><621>: Abbrev Number: 5 (DW_TAG_const_type)
    <622>   DW_AT_type        : <0x5ae>
 <1><626>: Abbrev Number: 29 (DW_TAG_structure_type)
    <627>   DW_AT_name        : (indirect string, offset: 0x97dc1): _reent
    <62b>   DW_AT_byte_size   : 96
    <62c>   DW_AT_decl_file   : 11
    <62d>   DW_AT_decl_line   : 377
    <62f>   DW_AT_decl_column : 8
    <630>   DW_AT_sibling     : <0x769>
 <2><634>: Abbrev Number: 8 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x52c0f): _errno
    <639>   DW_AT_decl_file   : 11
    <63a>   DW_AT_decl_line   : 381
    <63c>   DW_AT_decl_column : 7
    <63d>   DW_AT_type        : <0x91>
    <641>   DW_AT_data_member_location: 0
 <2><642>: Abbrev Number: 8 (DW_TAG_member)
    <643>   DW_AT_name        : (indirect string, offset: 0x43936): _stdin
    <647>   DW_AT_decl_file   : 11
    <648>   DW_AT_decl_line   : 386
    <64a>   DW_AT_decl_column : 11
    <64b>   DW_AT_type        : <0x9c1>
    <64f>   DW_AT_data_member_location: 4
 <2><650>: Abbrev Number: 8 (DW_TAG_member)
    <651>   DW_AT_name        : (indirect string, offset: 0x8c2f2): _stdout
    <655>   DW_AT_decl_file   : 11
    <656>   DW_AT_decl_line   : 386
    <658>   DW_AT_decl_column : 20
    <659>   DW_AT_type        : <0x9c1>
    <65d>   DW_AT_data_member_location: 8
 <2><65e>: Abbrev Number: 8 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0x8ba2f): _stderr
    <663>   DW_AT_decl_file   : 11
    <664>   DW_AT_decl_line   : 386
    <666>   DW_AT_decl_column : 30
    <667>   DW_AT_type        : <0x9c1>
    <66b>   DW_AT_data_member_location: 12
 <2><66c>: Abbrev Number: 8 (DW_TAG_member)
    <66d>   DW_AT_name        : (indirect string, offset: 0x592c2): _inc
    <671>   DW_AT_decl_file   : 11
    <672>   DW_AT_decl_line   : 388
    <674>   DW_AT_decl_column : 8
    <675>   DW_AT_type        : <0x91>
    <679>   DW_AT_data_member_location: 16
 <2><67a>: Abbrev Number: 8 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x6f81c): _emergency
    <67f>   DW_AT_decl_file   : 11
    <680>   DW_AT_decl_line   : 390
    <682>   DW_AT_decl_column : 9
    <683>   DW_AT_type        : <0x8d5>
    <687>   DW_AT_data_member_location: 20
 <2><688>: Abbrev Number: 8 (DW_TAG_member)
    <689>   DW_AT_name        : (indirect string, offset: 0x3cbc5): __sdidinit
    <68d>   DW_AT_decl_file   : 11
    <68e>   DW_AT_decl_line   : 392
    <690>   DW_AT_decl_column : 7
    <691>   DW_AT_type        : <0x91>
    <695>   DW_AT_data_member_location: 24
 <2><696>: Abbrev Number: 8 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0xc601): _unspecified_locale_info
    <69b>   DW_AT_decl_file   : 11
    <69c>   DW_AT_decl_line   : 394
    <69e>   DW_AT_decl_column : 7
    <69f>   DW_AT_type        : <0x91>
    <6a3>   DW_AT_data_member_location: 28
 <2><6a4>: Abbrev Number: 8 (DW_TAG_member)
    <6a5>   DW_AT_name        : (indirect string, offset: 0x7d050): _locale
    <6a9>   DW_AT_decl_file   : 11
    <6aa>   DW_AT_decl_line   : 395
    <6ac>   DW_AT_decl_column : 22
    <6ad>   DW_AT_type        : <0xb29>
    <6b1>   DW_AT_data_member_location: 32
 <2><6b2>: Abbrev Number: 9 (DW_TAG_member)
    <6b3>   DW_AT_name        : _mp
    <6b7>   DW_AT_decl_file   : 11
    <6b8>   DW_AT_decl_line   : 397
    <6ba>   DW_AT_decl_column : 18
    <6bb>   DW_AT_type        : <0xb2f>
    <6bf>   DW_AT_data_member_location: 36
 <2><6c0>: Abbrev Number: 8 (DW_TAG_member)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x16002): __cleanup
    <6c5>   DW_AT_decl_file   : 11
    <6c6>   DW_AT_decl_line   : 399
    <6c8>   DW_AT_decl_column : 10
    <6c9>   DW_AT_type        : <0xb40>
    <6cd>   DW_AT_data_member_location: 40
 <2><6ce>: Abbrev Number: 8 (DW_TAG_member)
    <6cf>   DW_AT_name        : (indirect string, offset: 0x9a2b): _gamma_signgam
    <6d3>   DW_AT_decl_file   : 11
    <6d4>   DW_AT_decl_line   : 401
    <6d6>   DW_AT_decl_column : 7
    <6d7>   DW_AT_type        : <0x91>
    <6db>   DW_AT_data_member_location: 44
 <2><6dc>: Abbrev Number: 8 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0x67d72): _cvtlen
    <6e1>   DW_AT_decl_file   : 11
    <6e2>   DW_AT_decl_line   : 404
    <6e4>   DW_AT_decl_column : 7
    <6e5>   DW_AT_type        : <0x91>
    <6e9>   DW_AT_data_member_location: 48
 <2><6ea>: Abbrev Number: 8 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x410bc): _cvtbuf
    <6ef>   DW_AT_decl_file   : 11
    <6f0>   DW_AT_decl_line   : 405
    <6f2>   DW_AT_decl_column : 9
    <6f3>   DW_AT_type        : <0x8d5>
    <6f7>   DW_AT_data_member_location: 52
 <2><6f8>: Abbrev Number: 8 (DW_TAG_member)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x69b02): _r48
    <6fd>   DW_AT_decl_file   : 11
    <6fe>   DW_AT_decl_line   : 407
    <700>   DW_AT_decl_column : 19
    <701>   DW_AT_type        : <0xb46>
    <705>   DW_AT_data_member_location: 56
 <2><706>: Abbrev Number: 8 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x752a3): _localtime_buf
    <70b>   DW_AT_decl_file   : 11
    <70c>   DW_AT_decl_line   : 408
    <70e>   DW_AT_decl_column : 16
    <70f>   DW_AT_type        : <0xb4c>
    <713>   DW_AT_data_member_location: 60
 <2><714>: Abbrev Number: 8 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x2168b): _asctime_buf
    <719>   DW_AT_decl_file   : 11
    <71a>   DW_AT_decl_line   : 409
    <71c>   DW_AT_decl_column : 9
    <71d>   DW_AT_type        : <0x8d5>
    <721>   DW_AT_data_member_location: 64
 <2><722>: Abbrev Number: 8 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x70b5): _sig_func
    <727>   DW_AT_decl_file   : 11
    <728>   DW_AT_decl_line   : 412
    <72a>   DW_AT_decl_column : 12
    <72b>   DW_AT_type        : <0xb5d>
    <72f>   DW_AT_data_member_location: 68
 <2><730>: Abbrev Number: 8 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x64f04): __sglue
    <735>   DW_AT_decl_file   : 11
    <736>   DW_AT_decl_line   : 420
    <738>   DW_AT_decl_column : 16
    <739>   DW_AT_type        : <0x982>
    <73d>   DW_AT_data_member_location: 72
 <2><73e>: Abbrev Number: 8 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x261db): __sf
    <743>   DW_AT_decl_file   : 11
    <744>   DW_AT_decl_line   : 421
    <746>   DW_AT_decl_column : 11
    <747>   DW_AT_type        : <0x9c1>
    <74b>   DW_AT_data_member_location: 84
 <2><74c>: Abbrev Number: 8 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0x3f748): _misc
    <751>   DW_AT_decl_file   : 11
    <752>   DW_AT_decl_line   : 422
    <754>   DW_AT_decl_column : 23
    <755>   DW_AT_type        : <0xb69>
    <759>   DW_AT_data_member_location: 88
 <2><75a>: Abbrev Number: 8 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x57a7b): _signal_buf
    <75f>   DW_AT_decl_file   : 11
    <760>   DW_AT_decl_line   : 423
    <762>   DW_AT_decl_column : 9
    <763>   DW_AT_type        : <0x8d5>
    <767>   DW_AT_data_member_location: 92
 <2><768>: Abbrev Number: 0
 <1><769>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <76a>   DW_AT_byte_size   : 4
    <76b>   DW_AT_type        : <0x626>
 <1><76f>: Abbrev Number: 5 (DW_TAG_const_type)
    <770>   DW_AT_type        : <0x769>
 <1><774>: Abbrev Number: 26 (DW_TAG_structure_type)
    <775>   DW_AT_name        : (indirect string, offset: 0x6c298): __sFILE
    <779>   DW_AT_byte_size   : 104
    <77a>   DW_AT_decl_file   : 11
    <77b>   DW_AT_decl_line   : 186
    <77c>   DW_AT_decl_column : 8
    <77d>   DW_AT_sibling     : <0x8b7>
 <2><781>: Abbrev Number: 16 (DW_TAG_member)
    <782>   DW_AT_name        : _p
    <785>   DW_AT_decl_file   : 11
    <786>   DW_AT_decl_line   : 187
    <787>   DW_AT_decl_column : 18
    <788>   DW_AT_type        : <0x5a8>
    <78c>   DW_AT_data_member_location: 0
 <2><78d>: Abbrev Number: 16 (DW_TAG_member)
    <78e>   DW_AT_name        : _r
    <791>   DW_AT_decl_file   : 11
    <792>   DW_AT_decl_line   : 188
    <793>   DW_AT_decl_column : 7
    <794>   DW_AT_type        : <0x91>
    <798>   DW_AT_data_member_location: 4
 <2><799>: Abbrev Number: 16 (DW_TAG_member)
    <79a>   DW_AT_name        : _w
    <79d>   DW_AT_decl_file   : 11
    <79e>   DW_AT_decl_line   : 189
    <79f>   DW_AT_decl_column : 7
    <7a0>   DW_AT_type        : <0x91>
    <7a4>   DW_AT_data_member_location: 8
 <2><7a5>: Abbrev Number: 17 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x402e7): _flags
    <7aa>   DW_AT_decl_file   : 11
    <7ab>   DW_AT_decl_line   : 190
    <7ac>   DW_AT_decl_column : 9
    <7ad>   DW_AT_type        : <0x43>
    <7b1>   DW_AT_data_member_location: 12
 <2><7b2>: Abbrev Number: 17 (DW_TAG_member)
    <7b3>   DW_AT_name        : (indirect string, offset: 0x1588d): _file
    <7b7>   DW_AT_decl_file   : 11
    <7b8>   DW_AT_decl_line   : 191
    <7b9>   DW_AT_decl_column : 9
    <7ba>   DW_AT_type        : <0x43>
    <7be>   DW_AT_data_member_location: 14
 <2><7bf>: Abbrev Number: 16 (DW_TAG_member)
    <7c0>   DW_AT_name        : _bf
    <7c4>   DW_AT_decl_file   : 11
    <7c5>   DW_AT_decl_line   : 192
    <7c6>   DW_AT_decl_column : 17
    <7c7>   DW_AT_type        : <0x580>
    <7cb>   DW_AT_data_member_location: 16
 <2><7cc>: Abbrev Number: 17 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x40848): _lbfsize
    <7d1>   DW_AT_decl_file   : 11
    <7d2>   DW_AT_decl_line   : 193
    <7d3>   DW_AT_decl_column : 7
    <7d4>   DW_AT_type        : <0x91>
    <7d8>   DW_AT_data_member_location: 24
 <2><7d9>: Abbrev Number: 17 (DW_TAG_member)
    <7da>   DW_AT_name        : (indirect string, offset: 0x9328a): _data
    <7de>   DW_AT_decl_file   : 11
    <7df>   DW_AT_decl_line   : 196
    <7e0>   DW_AT_decl_column : 18
    <7e1>   DW_AT_type        : <0x769>
    <7e5>   DW_AT_data_member_location: 28
 <2><7e6>: Abbrev Number: 17 (DW_TAG_member)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x7dabb): _cookie
    <7eb>   DW_AT_decl_file   : 11
    <7ec>   DW_AT_decl_line   : 200
    <7ed>   DW_AT_decl_column : 10
    <7ee>   DW_AT_type        : <0x2c5>
    <7f2>   DW_AT_data_member_location: 32
 <2><7f3>: Abbrev Number: 17 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0x6f63c): _read
    <7f8>   DW_AT_decl_file   : 11
    <7f9>   DW_AT_decl_line   : 202
    <7fa>   DW_AT_decl_column : 29
    <7fb>   DW_AT_type        : <0x8e7>
    <7ff>   DW_AT_data_member_location: 36
 <2><800>: Abbrev Number: 17 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0x11947): _write
    <805>   DW_AT_decl_file   : 11
    <806>   DW_AT_decl_line   : 204
    <807>   DW_AT_decl_column : 29
    <808>   DW_AT_type        : <0x911>
    <80c>   DW_AT_data_member_location: 40
 <2><80d>: Abbrev Number: 17 (DW_TAG_member)
    <80e>   DW_AT_name        : (indirect string, offset: 0x8a660): _seek
    <812>   DW_AT_decl_file   : 11
    <813>   DW_AT_decl_line   : 207
    <814>   DW_AT_decl_column : 13
    <815>   DW_AT_type        : <0x935>
    <819>   DW_AT_data_member_location: 44
 <2><81a>: Abbrev Number: 17 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0x3d86a): _close
    <81f>   DW_AT_decl_file   : 11
    <820>   DW_AT_decl_line   : 208
    <821>   DW_AT_decl_column : 9
    <822>   DW_AT_type        : <0x94f>
    <826>   DW_AT_data_member_location: 48
 <2><827>: Abbrev Number: 16 (DW_TAG_member)
    <828>   DW_AT_name        : _ub
    <82c>   DW_AT_decl_file   : 11
    <82d>   DW_AT_decl_line   : 211
    <82e>   DW_AT_decl_column : 17
    <82f>   DW_AT_type        : <0x580>
    <833>   DW_AT_data_member_location: 52
 <2><834>: Abbrev Number: 16 (DW_TAG_member)
    <835>   DW_AT_name        : _up
    <839>   DW_AT_decl_file   : 11
    <83a>   DW_AT_decl_line   : 212
    <83b>   DW_AT_decl_column : 18
    <83c>   DW_AT_type        : <0x5a8>
    <840>   DW_AT_data_member_location: 60
 <2><841>: Abbrev Number: 16 (DW_TAG_member)
    <842>   DW_AT_name        : _ur
    <846>   DW_AT_decl_file   : 11
    <847>   DW_AT_decl_line   : 213
    <848>   DW_AT_decl_column : 7
    <849>   DW_AT_type        : <0x91>
    <84d>   DW_AT_data_member_location: 64
 <2><84e>: Abbrev Number: 17 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x263ef): _ubuf
    <853>   DW_AT_decl_file   : 11
    <854>   DW_AT_decl_line   : 216
    <855>   DW_AT_decl_column : 17
    <856>   DW_AT_type        : <0x955>
    <85a>   DW_AT_data_member_location: 68
 <2><85b>: Abbrev Number: 17 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x5fe4a): _nbuf
    <860>   DW_AT_decl_file   : 11
    <861>   DW_AT_decl_line   : 217
    <862>   DW_AT_decl_column : 17
    <863>   DW_AT_type        : <0x965>
    <867>   DW_AT_data_member_location: 71
 <2><868>: Abbrev Number: 16 (DW_TAG_member)
    <869>   DW_AT_name        : _lb
    <86d>   DW_AT_decl_file   : 11
    <86e>   DW_AT_decl_line   : 220
    <86f>   DW_AT_decl_column : 17
    <870>   DW_AT_type        : <0x580>
    <874>   DW_AT_data_member_location: 72
 <2><875>: Abbrev Number: 17 (DW_TAG_member)
    <876>   DW_AT_name        : (indirect string, offset: 0x23ae5): _blksize
    <87a>   DW_AT_decl_file   : 11
    <87b>   DW_AT_decl_line   : 223
    <87c>   DW_AT_decl_column : 7
    <87d>   DW_AT_type        : <0x91>
    <881>   DW_AT_data_member_location: 80
 <2><882>: Abbrev Number: 17 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0x2d292): _offset
    <887>   DW_AT_decl_file   : 11
    <888>   DW_AT_decl_line   : 224
    <889>   DW_AT_decl_column : 10
    <88a>   DW_AT_type        : <0x331>
    <88e>   DW_AT_data_member_location: 84
 <2><88f>: Abbrev Number: 17 (DW_TAG_member)
    <890>   DW_AT_name        : (indirect string, offset: 0x2b523): _lock
    <894>   DW_AT_decl_file   : 11
    <895>   DW_AT_decl_line   : 231
    <896>   DW_AT_decl_column : 12
    <897>   DW_AT_type        : <0x3ce>
    <89b>   DW_AT_data_member_location: 88
 <2><89c>: Abbrev Number: 17 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x1013e): _mbstate
    <8a1>   DW_AT_decl_file   : 11
    <8a2>   DW_AT_decl_line   : 233
    <8a3>   DW_AT_decl_column : 14
    <8a4>   DW_AT_type        : <0x39f>
    <8a8>   DW_AT_data_member_location: 92
 <2><8a9>: Abbrev Number: 17 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x72ac6): _flags2
    <8ae>   DW_AT_decl_file   : 11
    <8af>   DW_AT_decl_line   : 234
    <8b0>   DW_AT_decl_column : 9
    <8b1>   DW_AT_type        : <0x91>
    <8b5>   DW_AT_data_member_location: 100
 <2><8b6>: Abbrev Number: 0
 <1><8b7>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <8b8>   DW_AT_prototyped  : 1
    <8b8>   DW_AT_type        : <0x91>
    <8bc>   DW_AT_sibling     : <0x8d5>
 <2><8c0>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <8c1>   DW_AT_type        : <0x769>
 <2><8c5>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <8c6>   DW_AT_type        : <0x2c5>
 <2><8ca>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <8cb>   DW_AT_type        : <0x8d5>
 <2><8cf>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <8d0>   DW_AT_type        : <0x91>
 <2><8d4>: Abbrev Number: 0
 <1><8d5>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <8d6>   DW_AT_byte_size   : 4
    <8d7>   DW_AT_type        : <0x8db>
 <1><8db>: Abbrev Number: 2 (DW_TAG_base_type)
    <8dc>   DW_AT_byte_size   : 1
    <8dd>   DW_AT_encoding    : 8	(unsigned char)
    <8de>   DW_AT_name        : (indirect string, offset: 0x2d69f): char
 <1><8e2>: Abbrev Number: 5 (DW_TAG_const_type)
    <8e3>   DW_AT_type        : <0x8db>
 <1><8e7>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <8e8>   DW_AT_byte_size   : 4
    <8e9>   DW_AT_type        : <0x8b7>
 <1><8ed>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <8ee>   DW_AT_prototyped  : 1
    <8ee>   DW_AT_type        : <0x91>
    <8f2>   DW_AT_sibling     : <0x90b>
 <2><8f6>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <8f7>   DW_AT_type        : <0x769>
 <2><8fb>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <8fc>   DW_AT_type        : <0x2c5>
 <2><900>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <901>   DW_AT_type        : <0x90b>
 <2><905>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <906>   DW_AT_type        : <0x91>
 <2><90a>: Abbrev Number: 0
 <1><90b>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <90c>   DW_AT_byte_size   : 4
    <90d>   DW_AT_type        : <0x8e2>
 <1><911>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <912>   DW_AT_byte_size   : 4
    <913>   DW_AT_type        : <0x8ed>
 <1><917>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <918>   DW_AT_prototyped  : 1
    <918>   DW_AT_type        : <0x33d>
    <91c>   DW_AT_sibling     : <0x935>
 <2><920>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <921>   DW_AT_type        : <0x769>
 <2><925>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <926>   DW_AT_type        : <0x2c5>
 <2><92a>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <92b>   DW_AT_type        : <0x33d>
 <2><92f>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <930>   DW_AT_type        : <0x91>
 <2><934>: Abbrev Number: 0
 <1><935>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <936>   DW_AT_byte_size   : 4
    <937>   DW_AT_type        : <0x917>
 <1><93b>: Abbrev Number: 30 (DW_TAG_subroutine_type)
    <93c>   DW_AT_prototyped  : 1
    <93c>   DW_AT_type        : <0x91>
    <940>   DW_AT_sibling     : <0x94f>
 <2><944>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <945>   DW_AT_type        : <0x769>
 <2><949>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <94a>   DW_AT_type        : <0x2c5>
 <2><94e>: Abbrev Number: 0
 <1><94f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <950>   DW_AT_byte_size   : 4
    <951>   DW_AT_type        : <0x93b>
 <1><955>: Abbrev Number: 13 (DW_TAG_array_type)
    <956>   DW_AT_type        : <0x3c>
    <95a>   DW_AT_sibling     : <0x965>
 <2><95e>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <95f>   DW_AT_type        : <0x98>
    <963>   DW_AT_upper_bound : 2
 <2><964>: Abbrev Number: 0
 <1><965>: Abbrev Number: 13 (DW_TAG_array_type)
    <966>   DW_AT_type        : <0x3c>
    <96a>   DW_AT_sibling     : <0x975>
 <2><96e>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <96f>   DW_AT_type        : <0x98>
    <973>   DW_AT_upper_bound : 0
 <2><974>: Abbrev Number: 0
 <1><975>: Abbrev Number: 10 (DW_TAG_typedef)
    <976>   DW_AT_name        : (indirect string, offset: 0x4e617): __FILE
    <97a>   DW_AT_decl_file   : 11
    <97b>   DW_AT_decl_line   : 292
    <97d>   DW_AT_decl_column : 26
    <97e>   DW_AT_type        : <0x774>
 <1><982>: Abbrev Number: 29 (DW_TAG_structure_type)
    <983>   DW_AT_name        : (indirect string, offset: 0x6c4ac): _glue
    <987>   DW_AT_byte_size   : 12
    <988>   DW_AT_decl_file   : 11
    <989>   DW_AT_decl_line   : 296
    <98b>   DW_AT_decl_column : 8
    <98c>   DW_AT_sibling     : <0x9bb>
 <2><990>: Abbrev Number: 8 (DW_TAG_member)
    <991>   DW_AT_name        : (indirect string, offset: 0x53e75): _next
    <995>   DW_AT_decl_file   : 11
    <996>   DW_AT_decl_line   : 298
    <998>   DW_AT_decl_column : 17
    <999>   DW_AT_type        : <0x9bb>
    <99d>   DW_AT_data_member_location: 0
 <2><99e>: Abbrev Number: 8 (DW_TAG_member)
    <99f>   DW_AT_name        : (indirect string, offset: 0x34a07): _niobs
    <9a3>   DW_AT_decl_file   : 11
    <9a4>   DW_AT_decl_line   : 299
    <9a6>   DW_AT_decl_column : 7
    <9a7>   DW_AT_type        : <0x91>
    <9ab>   DW_AT_data_member_location: 4
 <2><9ac>: Abbrev Number: 8 (DW_TAG_member)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x476b3): _iobs
    <9b1>   DW_AT_decl_file   : 11
    <9b2>   DW_AT_decl_line   : 300
    <9b4>   DW_AT_decl_column : 11
    <9b5>   DW_AT_type        : <0x9c1>
    <9b9>   DW_AT_data_member_location: 8
 <2><9ba>: Abbrev Number: 0
 <1><9bb>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <9bc>   DW_AT_byte_size   : 4
    <9bd>   DW_AT_type        : <0x982>
 <1><9c1>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <9c2>   DW_AT_byte_size   : 4
    <9c3>   DW_AT_type        : <0x975>
 <1><9c7>: Abbrev Number: 29 (DW_TAG_structure_type)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x308e9): _rand48
    <9cc>   DW_AT_byte_size   : 24
    <9cd>   DW_AT_decl_file   : 11
    <9ce>   DW_AT_decl_line   : 324
    <9d0>   DW_AT_decl_column : 8
    <9d1>   DW_AT_sibling     : <0xa0e>
 <2><9d5>: Abbrev Number: 8 (DW_TAG_member)
    <9d6>   DW_AT_name        : (indirect string, offset: 0x28cdb): _seed
    <9da>   DW_AT_decl_file   : 11
    <9db>   DW_AT_decl_line   : 325
    <9dd>   DW_AT_decl_column : 18
    <9de>   DW_AT_type        : <0xa0e>
    <9e2>   DW_AT_data_member_location: 0
 <2><9e3>: Abbrev Number: 8 (DW_TAG_member)
    <9e4>   DW_AT_name        : (indirect string, offset: 0xb943): _mult
    <9e8>   DW_AT_decl_file   : 11
    <9e9>   DW_AT_decl_line   : 326
    <9eb>   DW_AT_decl_column : 18
    <9ec>   DW_AT_type        : <0xa0e>
    <9f0>   DW_AT_data_member_location: 6
 <2><9f1>: Abbrev Number: 8 (DW_TAG_member)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x48d27): _add
    <9f6>   DW_AT_decl_file   : 11
    <9f7>   DW_AT_decl_line   : 327
    <9f9>   DW_AT_decl_column : 18
    <9fa>   DW_AT_type        : <0x56>
    <9fe>   DW_AT_data_member_location: 12
 <2><9ff>: Abbrev Number: 8 (DW_TAG_member)
    <a00>   DW_AT_name        : (indirect string, offset: 0x53e70): _rand_next
    <a04>   DW_AT_decl_file   : 11
    <a05>   DW_AT_decl_line   : 330
    <a07>   DW_AT_decl_column : 36
    <a08>   DW_AT_type        : <0x8a>
    <a0c>   DW_AT_data_member_location: 16
 <2><a0d>: Abbrev Number: 0
 <1><a0e>: Abbrev Number: 13 (DW_TAG_array_type)
    <a0f>   DW_AT_type        : <0x56>
    <a13>   DW_AT_sibling     : <0xa1e>
 <2><a17>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <a18>   DW_AT_type        : <0x98>
    <a1c>   DW_AT_upper_bound : 2
 <2><a1d>: Abbrev Number: 0
 <1><a1e>: Abbrev Number: 29 (DW_TAG_structure_type)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x6b8f2): _mprec
    <a23>   DW_AT_byte_size   : 16
    <a24>   DW_AT_decl_file   : 11
    <a25>   DW_AT_decl_line   : 349
    <a27>   DW_AT_decl_column : 8
    <a28>   DW_AT_sibling     : <0xa65>
 <2><a2c>: Abbrev Number: 8 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x8c63b): _result
    <a31>   DW_AT_decl_file   : 11
    <a32>   DW_AT_decl_line   : 352
    <a34>   DW_AT_decl_column : 19
    <a35>   DW_AT_type        : <0x434>
    <a39>   DW_AT_data_member_location: 0
 <2><a3a>: Abbrev Number: 8 (DW_TAG_member)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x613c4): _result_k
    <a3f>   DW_AT_decl_file   : 11
    <a40>   DW_AT_decl_line   : 353
    <a42>   DW_AT_decl_column : 7
    <a43>   DW_AT_type        : <0x91>
    <a47>   DW_AT_data_member_location: 4
 <2><a48>: Abbrev Number: 8 (DW_TAG_member)
    <a49>   DW_AT_name        : (indirect string, offset: 0x433c7): _p5s
    <a4d>   DW_AT_decl_file   : 11
    <a4e>   DW_AT_decl_line   : 354
    <a50>   DW_AT_decl_column : 19
    <a51>   DW_AT_type        : <0x434>
    <a55>   DW_AT_data_member_location: 8
 <2><a56>: Abbrev Number: 8 (DW_TAG_member)
    <a57>   DW_AT_name        : (indirect string, offset: 0x51ba8): _freelist
    <a5b>   DW_AT_decl_file   : 11
    <a5c>   DW_AT_decl_line   : 355
    <a5e>   DW_AT_decl_column : 20
    <a5f>   DW_AT_type        : <0xa65>
    <a63>   DW_AT_data_member_location: 12
 <2><a64>: Abbrev Number: 0
 <1><a65>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <a66>   DW_AT_byte_size   : 4
    <a67>   DW_AT_type        : <0x434>
 <1><a6b>: Abbrev Number: 29 (DW_TAG_structure_type)
    <a6c>   DW_AT_name        : (indirect string, offset: 0x4336b): _misc_reent
    <a70>   DW_AT_byte_size   : 80
    <a71>   DW_AT_decl_file   : 11
    <a72>   DW_AT_decl_line   : 359
    <a74>   DW_AT_decl_column : 8
    <a75>   DW_AT_sibling     : <0xb14>
 <2><a79>: Abbrev Number: 8 (DW_TAG_member)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x80f17): _strtok_last
    <a7e>   DW_AT_decl_file   : 11
    <a7f>   DW_AT_decl_line   : 362
    <a81>   DW_AT_decl_column : 9
    <a82>   DW_AT_type        : <0x8d5>
    <a86>   DW_AT_data_member_location: 0
 <2><a87>: Abbrev Number: 8 (DW_TAG_member)
    <a88>   DW_AT_name        : (indirect string, offset: 0x3d142): _mblen_state
    <a8c>   DW_AT_decl_file   : 11
    <a8d>   DW_AT_decl_line   : 363
    <a8f>   DW_AT_decl_column : 14
    <a90>   DW_AT_type        : <0x39f>
    <a94>   DW_AT_data_member_location: 4
 <2><a95>: Abbrev Number: 8 (DW_TAG_member)
    <a96>   DW_AT_name        : (indirect string, offset: 0x80f46): _wctomb_state
    <a9a>   DW_AT_decl_file   : 11
    <a9b>   DW_AT_decl_line   : 364
    <a9d>   DW_AT_decl_column : 14
    <a9e>   DW_AT_type        : <0x39f>
    <aa2>   DW_AT_data_member_location: 12
 <2><aa3>: Abbrev Number: 8 (DW_TAG_member)
    <aa4>   DW_AT_name        : (indirect string, offset: 0x77fa1): _mbtowc_state
    <aa8>   DW_AT_decl_file   : 11
    <aa9>   DW_AT_decl_line   : 365
    <aab>   DW_AT_decl_column : 14
    <aac>   DW_AT_type        : <0x39f>
    <ab0>   DW_AT_data_member_location: 20
 <2><ab1>: Abbrev Number: 8 (DW_TAG_member)
    <ab2>   DW_AT_name        : (indirect string, offset: 0x47a8c): _l64a_buf
    <ab6>   DW_AT_decl_file   : 11
    <ab7>   DW_AT_decl_line   : 366
    <ab9>   DW_AT_decl_column : 8
    <aba>   DW_AT_type        : <0xb14>
    <abe>   DW_AT_data_member_location: 28
 <2><abf>: Abbrev Number: 8 (DW_TAG_member)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x801dc): _getdate_err
    <ac4>   DW_AT_decl_file   : 11
    <ac5>   DW_AT_decl_line   : 367
    <ac7>   DW_AT_decl_column : 7
    <ac8>   DW_AT_type        : <0x91>
    <acc>   DW_AT_data_member_location: 36
 <2><acd>: Abbrev Number: 8 (DW_TAG_member)
    <ace>   DW_AT_name        : (indirect string, offset: 0x44383): _mbrlen_state
    <ad2>   DW_AT_decl_file   : 11
    <ad3>   DW_AT_decl_line   : 368
    <ad5>   DW_AT_decl_column : 14
    <ad6>   DW_AT_type        : <0x39f>
    <ada>   DW_AT_data_member_location: 40
 <2><adb>: Abbrev Number: 8 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0x1f1d6): _mbrtowc_state
    <ae0>   DW_AT_decl_file   : 11
    <ae1>   DW_AT_decl_line   : 369
    <ae3>   DW_AT_decl_column : 14
    <ae4>   DW_AT_type        : <0x39f>
    <ae8>   DW_AT_data_member_location: 48
 <2><ae9>: Abbrev Number: 8 (DW_TAG_member)
    <aea>   DW_AT_name        : (indirect string, offset: 0x5d3ae): _mbsrtowcs_state
    <aee>   DW_AT_decl_file   : 11
    <aef>   DW_AT_decl_line   : 370
    <af1>   DW_AT_decl_column : 14
    <af2>   DW_AT_type        : <0x39f>
    <af6>   DW_AT_data_member_location: 56
 <2><af7>: Abbrev Number: 8 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0x2b1d9): _wcrtomb_state
    <afc>   DW_AT_decl_file   : 11
    <afd>   DW_AT_decl_line   : 371
    <aff>   DW_AT_decl_column : 14
    <b00>   DW_AT_type        : <0x39f>
    <b04>   DW_AT_data_member_location: 64
 <2><b05>: Abbrev Number: 8 (DW_TAG_member)
    <b06>   DW_AT_name        : (indirect string, offset: 0x5080e): _wcsrtombs_state
    <b0a>   DW_AT_decl_file   : 11
    <b0b>   DW_AT_decl_line   : 372
    <b0d>   DW_AT_decl_column : 14
    <b0e>   DW_AT_type        : <0x39f>
    <b12>   DW_AT_data_member_location: 72
 <2><b13>: Abbrev Number: 0
 <1><b14>: Abbrev Number: 13 (DW_TAG_array_type)
    <b15>   DW_AT_type        : <0x8db>
    <b19>   DW_AT_sibling     : <0xb24>
 <2><b1d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <b1e>   DW_AT_type        : <0x98>
    <b22>   DW_AT_upper_bound : 7
 <2><b23>: Abbrev Number: 0
 <1><b24>: Abbrev Number: 25 (DW_TAG_structure_type)
    <b25>   DW_AT_name        : (indirect string, offset: 0x4f1b4): __locale_t
    <b29>   DW_AT_declaration : 1
 <1><b29>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b2a>   DW_AT_byte_size   : 4
    <b2b>   DW_AT_type        : <0xb24>
 <1><b2f>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b30>   DW_AT_byte_size   : 4
    <b31>   DW_AT_type        : <0xa1e>
 <1><b35>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <b36>   DW_AT_prototyped  : 1
    <b36>   DW_AT_sibling     : <0xb40>
 <2><b3a>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <b3b>   DW_AT_type        : <0x769>
 <2><b3f>: Abbrev Number: 0
 <1><b40>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b41>   DW_AT_byte_size   : 4
    <b42>   DW_AT_type        : <0xb35>
 <1><b46>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b47>   DW_AT_byte_size   : 4
    <b48>   DW_AT_type        : <0x9c7>
 <1><b4c>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b4d>   DW_AT_byte_size   : 4
    <b4e>   DW_AT_type        : <0x44a>
 <1><b52>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <b53>   DW_AT_prototyped  : 1
    <b53>   DW_AT_sibling     : <0xb5d>
 <2><b57>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <b58>   DW_AT_type        : <0x91>
 <2><b5c>: Abbrev Number: 0
 <1><b5d>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b5e>   DW_AT_byte_size   : 4
    <b5f>   DW_AT_type        : <0xb63>
 <1><b63>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b64>   DW_AT_byte_size   : 4
    <b65>   DW_AT_type        : <0xb52>
 <1><b69>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <b6a>   DW_AT_byte_size   : 4
    <b6b>   DW_AT_type        : <0xa6b>
 <1><b6f>: Abbrev Number: 11 (DW_TAG_variable)
    <b70>   DW_AT_name        : (indirect string, offset: 0x4392d): __sf_fake_stdin
    <b74>   DW_AT_decl_file   : 11
    <b75>   DW_AT_decl_line   : 463
    <b77>   DW_AT_decl_column : 34
    <b78>   DW_AT_type        : <0x621>
    <b7c>   DW_AT_external    : 1
    <b7c>   DW_AT_declaration : 1
 <1><b7c>: Abbrev Number: 11 (DW_TAG_variable)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x8c2e9): __sf_fake_stdout
    <b81>   DW_AT_decl_file   : 11
    <b82>   DW_AT_decl_line   : 464
    <b84>   DW_AT_decl_column : 34
    <b85>   DW_AT_type        : <0x621>
    <b89>   DW_AT_external    : 1
    <b89>   DW_AT_declaration : 1
 <1><b89>: Abbrev Number: 11 (DW_TAG_variable)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x8ba26): __sf_fake_stderr
    <b8e>   DW_AT_decl_file   : 11
    <b8f>   DW_AT_decl_line   : 465
    <b91>   DW_AT_decl_column : 34
    <b92>   DW_AT_type        : <0x621>
    <b96>   DW_AT_external    : 1
    <b96>   DW_AT_declaration : 1
 <1><b96>: Abbrev Number: 11 (DW_TAG_variable)
    <b97>   DW_AT_name        : (indirect string, offset: 0x2165d): _impure_ptr
    <b9b>   DW_AT_decl_file   : 11
    <b9c>   DW_AT_decl_line   : 819
    <b9e>   DW_AT_decl_column : 23
    <b9f>   DW_AT_type        : <0x769>
    <ba3>   DW_AT_external    : 1
    <ba3>   DW_AT_declaration : 1
 <1><ba3>: Abbrev Number: 11 (DW_TAG_variable)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x7573d): _global_impure_ptr
    <ba8>   DW_AT_decl_file   : 11
    <ba9>   DW_AT_decl_line   : 820
    <bab>   DW_AT_decl_column : 29
    <bac>   DW_AT_type        : <0x76f>
    <bb0>   DW_AT_external    : 1
    <bb0>   DW_AT_declaration : 1
 <1><bb0>: Abbrev Number: 11 (DW_TAG_variable)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x289b): _global_atexit
    <bb5>   DW_AT_decl_file   : 11
    <bb6>   DW_AT_decl_line   : 838
    <bb8>   DW_AT_decl_column : 24
    <bb9>   DW_AT_type        : <0x564>
    <bbd>   DW_AT_external    : 1
    <bbd>   DW_AT_declaration : 1
 <1><bbd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <bbe>   DW_AT_byte_size   : 5
    <bbf>   DW_AT_decl_file   : 1
    <bc0>   DW_AT_decl_line   : 8
    <bc1>   DW_AT_decl_column : 9
    <bc2>   DW_AT_sibling     : <0xc08>
 <2><bc6>: Abbrev Number: 17 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x46cd4): DisplayControl
    <bcb>   DW_AT_decl_file   : 1
    <bcc>   DW_AT_decl_line   : 9
    <bcd>   DW_AT_decl_column : 10
    <bce>   DW_AT_type        : <0x9f>
    <bd2>   DW_AT_data_member_location: 0
 <2><bd3>: Abbrev Number: 17 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x5e13b): DisplayFunction
    <bd8>   DW_AT_decl_file   : 1
    <bd9>   DW_AT_decl_line   : 10
    <bda>   DW_AT_decl_column : 10
    <bdb>   DW_AT_type        : <0x9f>
    <bdf>   DW_AT_data_member_location: 1
 <2><be0>: Abbrev Number: 17 (DW_TAG_member)
    <be1>   DW_AT_name        : (indirect string, offset: 0x2e25): DisplayMode
    <be5>   DW_AT_decl_file   : 1
    <be6>   DW_AT_decl_line   : 11
    <be7>   DW_AT_decl_column : 10
    <be8>   DW_AT_type        : <0x9f>
    <bec>   DW_AT_data_member_location: 2
 <2><bed>: Abbrev Number: 17 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0xf77b): currentX
    <bf2>   DW_AT_decl_file   : 1
    <bf3>   DW_AT_decl_line   : 12
    <bf4>   DW_AT_decl_column : 10
    <bf5>   DW_AT_type        : <0x9f>
    <bf9>   DW_AT_data_member_location: 3
 <2><bfa>: Abbrev Number: 17 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0xf784): currentY
    <bff>   DW_AT_decl_file   : 1
    <c00>   DW_AT_decl_line   : 13
    <c01>   DW_AT_decl_column : 10
    <c02>   DW_AT_type        : <0x9f>
    <c06>   DW_AT_data_member_location: 4
 <2><c07>: Abbrev Number: 0
 <1><c08>: Abbrev Number: 3 (DW_TAG_typedef)
    <c09>   DW_AT_name        : (indirect string, offset: 0x310fe): LCD_Options_t
    <c0d>   DW_AT_decl_file   : 1
    <c0e>   DW_AT_decl_line   : 15
    <c0f>   DW_AT_decl_column : 3
    <c10>   DW_AT_type        : <0xbbd>
 <1><c14>: Abbrev Number: 33 (DW_TAG_variable)
    <c15>   DW_AT_name        : (indirect string, offset: 0x317e2): LCD_Opts
    <c19>   DW_AT_decl_file   : 1
    <c1a>   DW_AT_decl_line   : 24
    <c1b>   DW_AT_decl_column : 22
    <c1c>   DW_AT_type        : <0xc08>
    <c20>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><c26>: Abbrev Number: 34 (DW_TAG_subprogram)
    <c27>   DW_AT_external    : 1
    <c27>   DW_AT_name        : (indirect string, offset: 0x11f11): LCD_Put
    <c2b>   DW_AT_decl_file   : 1
    <c2c>   DW_AT_decl_line   : 266
    <c2e>   DW_AT_decl_column : 6
    <c2f>   DW_AT_prototyped  : 1
    <c2f>   DW_AT_low_pc      : 0x0
    <c33>   DW_AT_high_pc     : 0x1a
    <c37>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c39>   DW_AT_GNU_all_tail_call_sites: 1
    <c39>   DW_AT_sibling     : <0xc4e>
 <2><c3d>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x47e05): Data
    <c42>   DW_AT_decl_file   : 1
    <c43>   DW_AT_decl_line   : 266
    <c45>   DW_AT_decl_column : 22
    <c46>   DW_AT_type        : <0x9f>
    <c4a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c4d>: Abbrev Number: 0
 <1><c4e>: Abbrev Number: 36 (DW_TAG_subprogram)
    <c4f>   DW_AT_name        : (indirect string, offset: 0x77cf8): LCD_CursorSet
    <c53>   DW_AT_decl_file   : 1
    <c54>   DW_AT_decl_line   : 256
    <c56>   DW_AT_decl_column : 13
    <c57>   DW_AT_prototyped  : 1
    <c57>   DW_AT_low_pc      : 0x8000940
    <c5b>   DW_AT_high_pc     : 0x5c
    <c5f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c61>   DW_AT_GNU_all_tail_call_sites: 1
    <c61>   DW_AT_sibling     : <0xc96>
 <2><c65>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <c66>   DW_AT_name        : col
    <c6a>   DW_AT_decl_file   : 1
    <c6b>   DW_AT_decl_line   : 256
    <c6d>   DW_AT_decl_column : 35
    <c6e>   DW_AT_type        : <0x9f>
    <c72>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><c75>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <c76>   DW_AT_name        : row
    <c7a>   DW_AT_decl_file   : 1
    <c7b>   DW_AT_decl_line   : 256
    <c7d>   DW_AT_decl_column : 48
    <c7e>   DW_AT_type        : <0x9f>
    <c82>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><c85>: Abbrev Number: 38 (DW_TAG_variable)
    <c86>   DW_AT_name        : (indirect string, offset: 0x79b5): row_offsets
    <c8a>   DW_AT_decl_file   : 1
    <c8b>   DW_AT_decl_line   : 258
    <c8d>   DW_AT_decl_column : 10
    <c8e>   DW_AT_type        : <0xc96>
    <c92>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c95>: Abbrev Number: 0
 <1><c96>: Abbrev Number: 13 (DW_TAG_array_type)
    <c97>   DW_AT_type        : <0x9f>
    <c9b>   DW_AT_sibling     : <0xca6>
 <2><c9f>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <ca0>   DW_AT_type        : <0x98>
    <ca4>   DW_AT_upper_bound : 3
 <2><ca5>: Abbrev Number: 0
 <1><ca6>: Abbrev Number: 39 (DW_TAG_subprogram)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x38d54): LCD_Cmd4bit
    <cab>   DW_AT_decl_file   : 1
    <cac>   DW_AT_decl_line   : 247
    <cad>   DW_AT_decl_column : 13
    <cae>   DW_AT_prototyped  : 1
    <cae>   DW_AT_low_pc      : 0x80008b8
    <cb2>   DW_AT_high_pc     : 0x88
    <cb6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cb8>   DW_AT_GNU_all_tail_call_sites: 1
    <cb8>   DW_AT_sibling     : <0xccc>
 <2><cbc>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <cbd>   DW_AT_name        : cmd
    <cc1>   DW_AT_decl_file   : 1
    <cc2>   DW_AT_decl_line   : 247
    <cc3>   DW_AT_decl_column : 33
    <cc4>   DW_AT_type        : <0x9f>
    <cc8>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><ccb>: Abbrev Number: 0
 <1><ccc>: Abbrev Number: 39 (DW_TAG_subprogram)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x47e01): LCD_Data
    <cd1>   DW_AT_decl_file   : 1
    <cd2>   DW_AT_decl_line   : 240
    <cd3>   DW_AT_decl_column : 13
    <cd4>   DW_AT_prototyped  : 1
    <cd4>   DW_AT_low_pc      : 0x800087c
    <cd8>   DW_AT_high_pc     : 0x3c
    <cdc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cde>   DW_AT_GNU_all_tail_call_sites: 1
    <cde>   DW_AT_sibling     : <0xcf2>
 <2><ce2>: Abbrev Number: 41 (DW_TAG_formal_parameter)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x9328b): data
    <ce7>   DW_AT_decl_file   : 1
    <ce8>   DW_AT_decl_line   : 240
    <ce9>   DW_AT_decl_column : 30
    <cea>   DW_AT_type        : <0x9f>
    <cee>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><cf1>: Abbrev Number: 0
 <1><cf2>: Abbrev Number: 39 (DW_TAG_subprogram)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x2e4f6): LCD_Cmd
    <cf7>   DW_AT_decl_file   : 1
    <cf8>   DW_AT_decl_line   : 233
    <cf9>   DW_AT_decl_column : 13
    <cfa>   DW_AT_prototyped  : 1
    <cfa>   DW_AT_low_pc      : 0x8000840
    <cfe>   DW_AT_high_pc     : 0x3c
    <d02>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d04>   DW_AT_GNU_all_tail_call_sites: 1
    <d04>   DW_AT_sibling     : <0xd18>
 <2><d08>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <d09>   DW_AT_name        : cmd
    <d0d>   DW_AT_decl_file   : 1
    <d0e>   DW_AT_decl_line   : 233
    <d0f>   DW_AT_decl_column : 29
    <d10>   DW_AT_type        : <0x9f>
    <d14>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><d17>: Abbrev Number: 0
 <1><d18>: Abbrev Number: 42 (DW_TAG_subprogram)
    <d19>   DW_AT_external    : 1
    <d19>   DW_AT_name        : (indirect string, offset: 0x304c3): LCD_PutCustom
    <d1d>   DW_AT_decl_file   : 1
    <d1e>   DW_AT_decl_line   : 227
    <d1f>   DW_AT_decl_column : 6
    <d20>   DW_AT_prototyped  : 1
    <d20>   DW_AT_low_pc      : 0x0
    <d24>   DW_AT_high_pc     : 0x2e
    <d28>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d2a>   DW_AT_GNU_all_tail_call_sites: 1
    <d2a>   DW_AT_sibling     : <0xd58>
 <2><d2e>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <d2f>   DW_AT_name        : x
    <d31>   DW_AT_decl_file   : 1
    <d32>   DW_AT_decl_line   : 227
    <d33>   DW_AT_decl_column : 28
    <d34>   DW_AT_type        : <0x9f>
    <d38>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><d3b>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <d3c>   DW_AT_name        : y
    <d3e>   DW_AT_decl_file   : 1
    <d3f>   DW_AT_decl_line   : 227
    <d40>   DW_AT_decl_column : 39
    <d41>   DW_AT_type        : <0x9f>
    <d45>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><d48>: Abbrev Number: 41 (DW_TAG_formal_parameter)
    <d49>   DW_AT_name        : (indirect string, offset: 0x436b8): location
    <d4d>   DW_AT_decl_file   : 1
    <d4e>   DW_AT_decl_line   : 227
    <d4f>   DW_AT_decl_column : 50
    <d50>   DW_AT_type        : <0x9f>
    <d54>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <2><d57>: Abbrev Number: 0
 <1><d58>: Abbrev Number: 42 (DW_TAG_subprogram)
    <d59>   DW_AT_external    : 1
    <d59>   DW_AT_name        : (indirect string, offset: 0x798a1): LCD_CreateChar
    <d5d>   DW_AT_decl_file   : 1
    <d5e>   DW_AT_decl_line   : 215
    <d5f>   DW_AT_decl_column : 6
    <d60>   DW_AT_prototyped  : 1
    <d60>   DW_AT_low_pc      : 0x0
    <d64>   DW_AT_high_pc     : 0x52
    <d68>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d6a>   DW_AT_GNU_all_tail_call_sites: 1
    <d6a>   DW_AT_sibling     : <0xd9a>
 <2><d6e>: Abbrev Number: 41 (DW_TAG_formal_parameter)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x436b8): location
    <d73>   DW_AT_decl_file   : 1
    <d74>   DW_AT_decl_line   : 215
    <d75>   DW_AT_decl_column : 29
    <d76>   DW_AT_type        : <0x9f>
    <d7a>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><d7d>: Abbrev Number: 41 (DW_TAG_formal_parameter)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x9328b): data
    <d82>   DW_AT_decl_file   : 1
    <d83>   DW_AT_decl_line   : 215
    <d84>   DW_AT_decl_column : 48
    <d85>   DW_AT_type        : <0x2c7>
    <d89>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d8c>: Abbrev Number: 43 (DW_TAG_variable)
    <d8d>   DW_AT_name        : i
    <d8f>   DW_AT_decl_file   : 1
    <d90>   DW_AT_decl_line   : 217
    <d91>   DW_AT_decl_column : 10
    <d92>   DW_AT_type        : <0x9f>
    <d96>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><d99>: Abbrev Number: 0
 <1><d9a>: Abbrev Number: 44 (DW_TAG_subprogram)
    <d9b>   DW_AT_external    : 1
    <d9b>   DW_AT_name        : (indirect string, offset: 0x30639): LCD_ScrollRight
    <d9f>   DW_AT_decl_file   : 1
    <da0>   DW_AT_decl_line   : 210
    <da1>   DW_AT_decl_column : 6
    <da2>   DW_AT_prototyped  : 1
    <da2>   DW_AT_low_pc      : 0x0
    <da6>   DW_AT_high_pc     : 0xe
    <daa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dac>   DW_AT_GNU_all_tail_call_sites: 1
 <1><dac>: Abbrev Number: 44 (DW_TAG_subprogram)
    <dad>   DW_AT_external    : 1
    <dad>   DW_AT_name        : (indirect string, offset: 0x42f8a): LCD_ScrollLeft
    <db1>   DW_AT_decl_file   : 1
    <db2>   DW_AT_decl_line   : 205
    <db3>   DW_AT_decl_column : 6
    <db4>   DW_AT_prototyped  : 1
    <db4>   DW_AT_low_pc      : 0x0
    <db8>   DW_AT_high_pc     : 0xe
    <dbc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dbe>   DW_AT_GNU_all_tail_call_sites: 1
 <1><dbe>: Abbrev Number: 44 (DW_TAG_subprogram)
    <dbf>   DW_AT_external    : 1
    <dbf>   DW_AT_name        : (indirect string, offset: 0x2aaa4): LCD_CursorOff
    <dc3>   DW_AT_decl_file   : 1
    <dc4>   DW_AT_decl_line   : 199
    <dc5>   DW_AT_decl_column : 6
    <dc6>   DW_AT_prototyped  : 1
    <dc6>   DW_AT_low_pc      : 0x0
    <dca>   DW_AT_high_pc     : 0x2c
    <dce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd0>   DW_AT_GNU_all_tail_call_sites: 1
 <1><dd0>: Abbrev Number: 44 (DW_TAG_subprogram)
    <dd1>   DW_AT_external    : 1
    <dd1>   DW_AT_name        : (indirect string, offset: 0x75a46): LCD_CursorOn
    <dd5>   DW_AT_decl_file   : 1
    <dd6>   DW_AT_decl_line   : 193
    <dd7>   DW_AT_decl_column : 6
    <dd8>   DW_AT_prototyped  : 1
    <dd8>   DW_AT_low_pc      : 0x0
    <ddc>   DW_AT_high_pc     : 0x2c
    <de0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <de2>   DW_AT_GNU_all_tail_call_sites: 1
 <1><de2>: Abbrev Number: 44 (DW_TAG_subprogram)
    <de3>   DW_AT_external    : 1
    <de3>   DW_AT_name        : (indirect string, offset: 0xa91a): LCD_BlinkOff
    <de7>   DW_AT_decl_file   : 1
    <de8>   DW_AT_decl_line   : 187
    <de9>   DW_AT_decl_column : 6
    <dea>   DW_AT_prototyped  : 1
    <dea>   DW_AT_low_pc      : 0x0
    <dee>   DW_AT_high_pc     : 0x2c
    <df2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <df4>   DW_AT_GNU_all_tail_call_sites: 1
 <1><df4>: Abbrev Number: 44 (DW_TAG_subprogram)
    <df5>   DW_AT_external    : 1
    <df5>   DW_AT_name        : (indirect string, offset: 0x347d8): LCD_BlinkOn
    <df9>   DW_AT_decl_file   : 1
    <dfa>   DW_AT_decl_line   : 181
    <dfb>   DW_AT_decl_column : 6
    <dfc>   DW_AT_prototyped  : 1
    <dfc>   DW_AT_low_pc      : 0x0
    <e00>   DW_AT_high_pc     : 0x2c
    <e04>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e06>   DW_AT_GNU_all_tail_call_sites: 1
 <1><e06>: Abbrev Number: 44 (DW_TAG_subprogram)
    <e07>   DW_AT_external    : 1
    <e07>   DW_AT_name        : (indirect string, offset: 0x52e66): LCD_DisplayOff
    <e0b>   DW_AT_decl_file   : 1
    <e0c>   DW_AT_decl_line   : 175
    <e0d>   DW_AT_decl_column : 6
    <e0e>   DW_AT_prototyped  : 1
    <e0e>   DW_AT_low_pc      : 0x0
    <e12>   DW_AT_high_pc     : 0x2c
    <e16>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e18>   DW_AT_GNU_all_tail_call_sites: 1
 <1><e18>: Abbrev Number: 44 (DW_TAG_subprogram)
    <e19>   DW_AT_external    : 1
    <e19>   DW_AT_name        : (indirect string, offset: 0x75fb): LCD_DisplayOn
    <e1d>   DW_AT_decl_file   : 1
    <e1e>   DW_AT_decl_line   : 169
    <e1f>   DW_AT_decl_column : 6
    <e20>   DW_AT_prototyped  : 1
    <e20>   DW_AT_low_pc      : 0x8000814
    <e24>   DW_AT_high_pc     : 0x2c
    <e28>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e2a>   DW_AT_GNU_all_tail_call_sites: 1
 <1><e2a>: Abbrev Number: 42 (DW_TAG_subprogram)
    <e2b>   DW_AT_external    : 1
    <e2b>   DW_AT_name        : (indirect string, offset: 0x40274): LCD_Puts
    <e2f>   DW_AT_decl_file   : 1
    <e30>   DW_AT_decl_line   : 140
    <e31>   DW_AT_decl_column : 6
    <e32>   DW_AT_prototyped  : 1
    <e32>   DW_AT_low_pc      : 0x800075c
    <e36>   DW_AT_high_pc     : 0xb8
    <e3a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e3c>   DW_AT_GNU_all_tail_call_sites: 1
    <e3c>   DW_AT_sibling     : <0xe6a>
 <2><e40>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <e41>   DW_AT_name        : x
    <e43>   DW_AT_decl_file   : 1
    <e44>   DW_AT_decl_line   : 140
    <e45>   DW_AT_decl_column : 23
    <e46>   DW_AT_type        : <0x9f>
    <e4a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><e4d>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <e4e>   DW_AT_name        : y
    <e50>   DW_AT_decl_file   : 1
    <e51>   DW_AT_decl_line   : 140
    <e52>   DW_AT_decl_column : 34
    <e53>   DW_AT_type        : <0x9f>
    <e57>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><e5a>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <e5b>   DW_AT_name        : str
    <e5f>   DW_AT_decl_file   : 1
    <e60>   DW_AT_decl_line   : 140
    <e61>   DW_AT_decl_column : 43
    <e62>   DW_AT_type        : <0x8d5>
    <e66>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><e69>: Abbrev Number: 0
 <1><e6a>: Abbrev Number: 44 (DW_TAG_subprogram)
    <e6b>   DW_AT_external    : 1
    <e6b>   DW_AT_name        : (indirect string, offset: 0x17b87): LCD_Clear
    <e6f>   DW_AT_decl_file   : 1
    <e70>   DW_AT_decl_line   : 134
    <e71>   DW_AT_decl_column : 6
    <e72>   DW_AT_prototyped  : 1
    <e72>   DW_AT_low_pc      : 0x8000748
    <e76>   DW_AT_high_pc     : 0x14
    <e7a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e7c>   DW_AT_GNU_all_tail_call_sites: 1
 <1><e7c>: Abbrev Number: 42 (DW_TAG_subprogram)
    <e7d>   DW_AT_external    : 1
    <e7d>   DW_AT_name        : (indirect string, offset: 0x1b1dd): LCD_Init
    <e81>   DW_AT_decl_file   : 1
    <e82>   DW_AT_decl_line   : 80
    <e83>   DW_AT_decl_column : 6
    <e84>   DW_AT_prototyped  : 1
    <e84>   DW_AT_low_pc      : 0x800061c
    <e88>   DW_AT_high_pc     : 0x12c
    <e8c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e8e>   DW_AT_GNU_all_tail_call_sites: 1
    <e8e>   DW_AT_sibling     : <0xea2>
 <2><e92>: Abbrev Number: 33 (DW_TAG_variable)
    <e93>   DW_AT_name        : (indirect string, offset: 0x726b): gpio
    <e97>   DW_AT_decl_file   : 1
    <e98>   DW_AT_decl_line   : 82
    <e99>   DW_AT_decl_column : 21
    <e9a>   DW_AT_type        : <0x28b>
    <e9e>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><ea1>: Abbrev Number: 0
 <1><ea2>: Abbrev Number: 42 (DW_TAG_subprogram)
    <ea3>   DW_AT_external    : 1
    <ea3>   DW_AT_name        : (indirect string, offset: 0x6084): LCD_Delay_ms
    <ea7>   DW_AT_decl_file   : 1
    <ea8>   DW_AT_decl_line   : 71
    <ea9>   DW_AT_decl_column : 7
    <eaa>   DW_AT_prototyped  : 1
    <eaa>   DW_AT_low_pc      : 0x8000600
    <eae>   DW_AT_high_pc     : 0x1a
    <eb2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eb4>   DW_AT_GNU_all_tail_call_sites: 1
    <eb4>   DW_AT_sibling     : <0xec7>
 <2><eb8>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <eb9>   DW_AT_name        : ms
    <ebc>   DW_AT_decl_file   : 1
    <ebd>   DW_AT_decl_line   : 71
    <ebe>   DW_AT_decl_column : 29
    <ebf>   DW_AT_type        : <0x9f>
    <ec3>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><ec6>: Abbrev Number: 0
 <1><ec7>: Abbrev Number: 45 (DW_TAG_subprogram)
    <ec8>   DW_AT_external    : 1
    <ec8>   DW_AT_name        : (indirect string, offset: 0x81b6): LCD_Delay_us
    <ecc>   DW_AT_decl_file   : 1
    <ecd>   DW_AT_decl_line   : 64
    <ece>   DW_AT_decl_column : 7
    <ecf>   DW_AT_prototyped  : 1
    <ecf>   DW_AT_low_pc      : 0x8000588
    <ed3>   DW_AT_high_pc     : 0x78
    <ed7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ed9>   DW_AT_GNU_all_tail_call_sites: 1
 <2><ed9>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <eda>   DW_AT_name        : us
    <edd>   DW_AT_decl_file   : 1
    <ede>   DW_AT_decl_line   : 64
    <edf>   DW_AT_decl_column : 30
    <ee0>   DW_AT_type        : <0xb0>
    <ee4>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><ee7>: Abbrev Number: 43 (DW_TAG_variable)
    <ee8>   DW_AT_name        : Div
    <eec>   DW_AT_decl_file   : 1
    <eed>   DW_AT_decl_line   : 66
    <eee>   DW_AT_decl_column : 13
    <eef>   DW_AT_type        : <0xcd>
    <ef3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ef6>: Abbrev Number: 33 (DW_TAG_variable)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x3ede4): StartMicros
    <efb>   DW_AT_decl_file   : 1
    <efc>   DW_AT_decl_line   : 67
    <efd>   DW_AT_decl_column : 13
    <efe>   DW_AT_type        : <0xcd>
    <f02>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f05>: Abbrev Number: 0
 <1><f06>: Abbrev Number: 0
  Compilation Unit @ offset 0xf07:
   Length:        0x1c9c (32-bit)
   Version:       4
   Abbrev Offset: 0x2c3
   Pointer Size:  4
 <0><f12>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <f13>   DW_AT_producer    : (indirect string, offset: 0x79f6f): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <f17>   DW_AT_language    : 12	(ANSI C99)
    <f18>   DW_AT_name        : (indirect string, offset: 0x8ffcf): ../Core/Src/main.c
    <f1c>   DW_AT_comp_dir    : (indirect string, offset: 0x18e5b): C:/Users/gaming/STM32CubeIDE/workspace_1.5.0/stm32/Debug
    <f20>   DW_AT_ranges      : 0xa8
    <f24>   DW_AT_low_pc      : 0x0
    <f28>   DW_AT_stmt_list   : 0xc92
    <f2c>   DW_AT_GNU_macros  : 0x15440
 <1><f30>: Abbrev Number: 2 (DW_TAG_base_type)
    <f31>   DW_AT_byte_size   : 1
    <f32>   DW_AT_encoding    : 6	(signed char)
    <f33>   DW_AT_name        : (indirect string, offset: 0x6fd6d): signed char
 <1><f37>: Abbrev Number: 3 (DW_TAG_typedef)
    <f38>   DW_AT_name        : (indirect string, offset: 0x28b35): __uint8_t
    <f3c>   DW_AT_decl_file   : 3
    <f3d>   DW_AT_decl_line   : 43
    <f3e>   DW_AT_decl_column : 24
    <f3f>   DW_AT_type        : <0xf43>
 <1><f43>: Abbrev Number: 2 (DW_TAG_base_type)
    <f44>   DW_AT_byte_size   : 1
    <f45>   DW_AT_encoding    : 8	(unsigned char)
    <f46>   DW_AT_name        : (indirect string, offset: 0x1d1aa): unsigned char
 <1><f4a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f4b>   DW_AT_byte_size   : 2
    <f4c>   DW_AT_encoding    : 5	(signed)
    <f4d>   DW_AT_name        : (indirect string, offset: 0x69686): short int
 <1><f51>: Abbrev Number: 3 (DW_TAG_typedef)
    <f52>   DW_AT_name        : (indirect string, offset: 0x7326e): __uint16_t
    <f56>   DW_AT_decl_file   : 3
    <f57>   DW_AT_decl_line   : 57
    <f58>   DW_AT_decl_column : 25
    <f59>   DW_AT_type        : <0xf5d>
 <1><f5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <f5e>   DW_AT_byte_size   : 2
    <f5f>   DW_AT_encoding    : 7	(unsigned)
    <f60>   DW_AT_name        : (indirect string, offset: 0x86db2): short unsigned int
 <1><f64>: Abbrev Number: 3 (DW_TAG_typedef)
    <f65>   DW_AT_name        : (indirect string, offset: 0x5683d): __int32_t
    <f69>   DW_AT_decl_file   : 3
    <f6a>   DW_AT_decl_line   : 77
    <f6b>   DW_AT_decl_column : 24
    <f6c>   DW_AT_type        : <0xf70>
 <1><f70>: Abbrev Number: 2 (DW_TAG_base_type)
    <f71>   DW_AT_byte_size   : 4
    <f72>   DW_AT_encoding    : 5	(signed)
    <f73>   DW_AT_name        : (indirect string, offset: 0xbae2): long int
 <1><f77>: Abbrev Number: 3 (DW_TAG_typedef)
    <f78>   DW_AT_name        : (indirect string, offset: 0x59b10): __uint32_t
    <f7c>   DW_AT_decl_file   : 3
    <f7d>   DW_AT_decl_line   : 79
    <f7e>   DW_AT_decl_column : 25
    <f7f>   DW_AT_type        : <0xf83>
 <1><f83>: Abbrev Number: 2 (DW_TAG_base_type)
    <f84>   DW_AT_byte_size   : 4
    <f85>   DW_AT_encoding    : 7	(unsigned)
    <f86>   DW_AT_name        : (indirect string, offset: 0x2b2a5): long unsigned int
 <1><f8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f8b>   DW_AT_byte_size   : 8
    <f8c>   DW_AT_encoding    : 5	(signed)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x4028c): long long int
 <1><f91>: Abbrev Number: 2 (DW_TAG_base_type)
    <f92>   DW_AT_byte_size   : 8
    <f93>   DW_AT_encoding    : 7	(unsigned)
    <f94>   DW_AT_name        : (indirect string, offset: 0x1da38): long long unsigned int
 <1><f98>: Abbrev Number: 4 (DW_TAG_base_type)
    <f99>   DW_AT_byte_size   : 4
    <f9a>   DW_AT_encoding    : 5	(signed)
    <f9b>   DW_AT_name        : int
 <1><f9f>: Abbrev Number: 2 (DW_TAG_base_type)
    <fa0>   DW_AT_byte_size   : 4
    <fa1>   DW_AT_encoding    : 7	(unsigned)
    <fa2>   DW_AT_name        : (indirect string, offset: 0xb5a1): unsigned int
 <1><fa6>: Abbrev Number: 3 (DW_TAG_typedef)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x28b37): uint8_t
    <fab>   DW_AT_decl_file   : 4
    <fac>   DW_AT_decl_line   : 24
    <fad>   DW_AT_decl_column : 19
    <fae>   DW_AT_type        : <0xf37>
 <1><fb2>: Abbrev Number: 5 (DW_TAG_const_type)
    <fb3>   DW_AT_type        : <0xfa6>
 <1><fb7>: Abbrev Number: 3 (DW_TAG_typedef)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x670bd): uint16_t
    <fbc>   DW_AT_decl_file   : 4
    <fbd>   DW_AT_decl_line   : 36
    <fbe>   DW_AT_decl_column : 20
    <fbf>   DW_AT_type        : <0xf51>
 <1><fc3>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <fc4>   DW_AT_type        : <0xfb7>
 <1><fc8>: Abbrev Number: 3 (DW_TAG_typedef)
    <fc9>   DW_AT_name        : (indirect string, offset: 0x5683f): int32_t
    <fcd>   DW_AT_decl_file   : 4
    <fce>   DW_AT_decl_line   : 44
    <fcf>   DW_AT_decl_column : 19
    <fd0>   DW_AT_type        : <0xf64>
 <1><fd4>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <fd5>   DW_AT_type        : <0xfc8>
 <1><fd9>: Abbrev Number: 3 (DW_TAG_typedef)
    <fda>   DW_AT_name        : (indirect string, offset: 0x6694e): uint32_t
    <fde>   DW_AT_decl_file   : 4
    <fdf>   DW_AT_decl_line   : 48
    <fe0>   DW_AT_decl_column : 20
    <fe1>   DW_AT_type        : <0xf77>
 <1><fe5>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <fe6>   DW_AT_type        : <0xfd9>
 <1><fea>: Abbrev Number: 7 (DW_TAG_array_type)
    <feb>   DW_AT_type        : <0xfd9>
    <fef>   DW_AT_sibling     : <0xffa>
 <2><ff3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ff4>   DW_AT_type        : <0xf9f>
    <ff8>   DW_AT_upper_bound : 0
 <2><ff9>: Abbrev Number: 0
 <1><ffa>: Abbrev Number: 7 (DW_TAG_array_type)
    <ffb>   DW_AT_type        : <0xfd9>
    <fff>   DW_AT_sibling     : <0x100a>
 <2><1003>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1004>   DW_AT_type        : <0xf9f>
    <1008>   DW_AT_upper_bound : 1
 <2><1009>: Abbrev Number: 0
 <1><100a>: Abbrev Number: 9 (DW_TAG_variable)
    <100b>   DW_AT_name        : (indirect string, offset: 0x2f94): ITM_RxBuffer
    <100f>   DW_AT_decl_file   : 5
    <1010>   DW_AT_decl_line   : 2052
    <1012>   DW_AT_decl_column : 25
    <1013>   DW_AT_type        : <0xfd4>
    <1017>   DW_AT_external    : 1
    <1017>   DW_AT_declaration : 1
 <1><1017>: Abbrev Number: 10 (DW_TAG_variable)
    <1018>   DW_AT_name        : (indirect string, offset: 0x4320): SystemCoreClock
    <101c>   DW_AT_decl_file   : 6
    <101d>   DW_AT_decl_line   : 74
    <101e>   DW_AT_decl_column : 17
    <101f>   DW_AT_type        : <0xfd9>
    <1023>   DW_AT_external    : 1
    <1023>   DW_AT_declaration : 1
 <1><1023>: Abbrev Number: 7 (DW_TAG_array_type)
    <1024>   DW_AT_type        : <0xfb2>
    <1028>   DW_AT_sibling     : <0x1033>
 <2><102c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <102d>   DW_AT_type        : <0xf9f>
    <1031>   DW_AT_upper_bound : 15
 <2><1032>: Abbrev Number: 0
 <1><1033>: Abbrev Number: 5 (DW_TAG_const_type)
    <1034>   DW_AT_type        : <0x1023>
 <1><1038>: Abbrev Number: 10 (DW_TAG_variable)
    <1039>   DW_AT_name        : (indirect string, offset: 0x801ac): AHBPrescTable
    <103d>   DW_AT_decl_file   : 6
    <103e>   DW_AT_decl_line   : 76
    <103f>   DW_AT_decl_column : 23
    <1040>   DW_AT_type        : <0x1033>
    <1044>   DW_AT_external    : 1
    <1044>   DW_AT_declaration : 1
 <1><1044>: Abbrev Number: 7 (DW_TAG_array_type)
    <1045>   DW_AT_type        : <0xfb2>
    <1049>   DW_AT_sibling     : <0x1054>
 <2><104d>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <104e>   DW_AT_type        : <0xf9f>
    <1052>   DW_AT_upper_bound : 7
 <2><1053>: Abbrev Number: 0
 <1><1054>: Abbrev Number: 5 (DW_TAG_const_type)
    <1055>   DW_AT_type        : <0x1044>
 <1><1059>: Abbrev Number: 10 (DW_TAG_variable)
    <105a>   DW_AT_name        : (indirect string, offset: 0x30f52): APBPrescTable
    <105e>   DW_AT_decl_file   : 6
    <105f>   DW_AT_decl_line   : 77
    <1060>   DW_AT_decl_column : 23
    <1061>   DW_AT_type        : <0x1054>
    <1065>   DW_AT_external    : 1
    <1065>   DW_AT_declaration : 1
 <1><1065>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1066>   DW_AT_byte_size   : 24
    <1067>   DW_AT_decl_file   : 7
    <1068>   DW_AT_decl_line   : 215
    <1069>   DW_AT_decl_column : 9
    <106a>   DW_AT_sibling     : <0x10bc>
 <2><106e>: Abbrev Number: 12 (DW_TAG_member)
    <106f>   DW_AT_name        : CR
    <1072>   DW_AT_decl_file   : 7
    <1073>   DW_AT_decl_line   : 217
    <1074>   DW_AT_decl_column : 17
    <1075>   DW_AT_type        : <0xfe5>
    <1079>   DW_AT_data_member_location: 0
 <2><107a>: Abbrev Number: 13 (DW_TAG_member)
    <107b>   DW_AT_name        : (indirect string, offset: 0x8eae3): NDTR
    <107f>   DW_AT_decl_file   : 7
    <1080>   DW_AT_decl_line   : 218
    <1081>   DW_AT_decl_column : 17
    <1082>   DW_AT_type        : <0xfe5>
    <1086>   DW_AT_data_member_location: 4
 <2><1087>: Abbrev Number: 12 (DW_TAG_member)
    <1088>   DW_AT_name        : PAR
    <108c>   DW_AT_decl_file   : 7
    <108d>   DW_AT_decl_line   : 219
    <108e>   DW_AT_decl_column : 17
    <108f>   DW_AT_type        : <0xfe5>
    <1093>   DW_AT_data_member_location: 8
 <2><1094>: Abbrev Number: 13 (DW_TAG_member)
    <1095>   DW_AT_name        : (indirect string, offset: 0x8e7c4): M0AR
    <1099>   DW_AT_decl_file   : 7
    <109a>   DW_AT_decl_line   : 220
    <109b>   DW_AT_decl_column : 17
    <109c>   DW_AT_type        : <0xfe5>
    <10a0>   DW_AT_data_member_location: 12
 <2><10a1>: Abbrev Number: 13 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x8d6ff): M1AR
    <10a6>   DW_AT_decl_file   : 7
    <10a7>   DW_AT_decl_line   : 221
    <10a8>   DW_AT_decl_column : 17
    <10a9>   DW_AT_type        : <0xfe5>
    <10ad>   DW_AT_data_member_location: 16
 <2><10ae>: Abbrev Number: 12 (DW_TAG_member)
    <10af>   DW_AT_name        : FCR
    <10b3>   DW_AT_decl_file   : 7
    <10b4>   DW_AT_decl_line   : 222
    <10b5>   DW_AT_decl_column : 17
    <10b6>   DW_AT_type        : <0xfe5>
    <10ba>   DW_AT_data_member_location: 20
 <2><10bb>: Abbrev Number: 0
 <1><10bc>: Abbrev Number: 3 (DW_TAG_typedef)
    <10bd>   DW_AT_name        : (indirect string, offset: 0x90110): DMA_Stream_TypeDef
    <10c1>   DW_AT_decl_file   : 7
    <10c2>   DW_AT_decl_line   : 223
    <10c3>   DW_AT_decl_column : 3
    <10c4>   DW_AT_type        : <0x1065>
 <1><10c8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <10c9>   DW_AT_byte_size   : 40
    <10ca>   DW_AT_decl_file   : 7
    <10cb>   DW_AT_decl_line   : 266
    <10cd>   DW_AT_decl_column : 9
    <10ce>   DW_AT_sibling     : <0x1151>
 <2><10d2>: Abbrev Number: 15 (DW_TAG_member)
    <10d3>   DW_AT_name        : (indirect string, offset: 0x10b7): MODER
    <10d7>   DW_AT_decl_file   : 7
    <10d8>   DW_AT_decl_line   : 268
    <10da>   DW_AT_decl_column : 17
    <10db>   DW_AT_type        : <0xfe5>
    <10df>   DW_AT_data_member_location: 0
 <2><10e0>: Abbrev Number: 15 (DW_TAG_member)
    <10e1>   DW_AT_name        : (indirect string, offset: 0x6d3fd): OTYPER
    <10e5>   DW_AT_decl_file   : 7
    <10e6>   DW_AT_decl_line   : 269
    <10e8>   DW_AT_decl_column : 17
    <10e9>   DW_AT_type        : <0xfe5>
    <10ed>   DW_AT_data_member_location: 4
 <2><10ee>: Abbrev Number: 15 (DW_TAG_member)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x7a6a2): OSPEEDR
    <10f3>   DW_AT_decl_file   : 7
    <10f4>   DW_AT_decl_line   : 270
    <10f6>   DW_AT_decl_column : 17
    <10f7>   DW_AT_type        : <0xfe5>
    <10fb>   DW_AT_data_member_location: 8
 <2><10fc>: Abbrev Number: 15 (DW_TAG_member)
    <10fd>   DW_AT_name        : (indirect string, offset: 0x19eec): PUPDR
    <1101>   DW_AT_decl_file   : 7
    <1102>   DW_AT_decl_line   : 271
    <1104>   DW_AT_decl_column : 17
    <1105>   DW_AT_type        : <0xfe5>
    <1109>   DW_AT_data_member_location: 12
 <2><110a>: Abbrev Number: 16 (DW_TAG_member)
    <110b>   DW_AT_name        : IDR
    <110f>   DW_AT_decl_file   : 7
    <1110>   DW_AT_decl_line   : 272
    <1112>   DW_AT_decl_column : 17
    <1113>   DW_AT_type        : <0xfe5>
    <1117>   DW_AT_data_member_location: 16
 <2><1118>: Abbrev Number: 16 (DW_TAG_member)
    <1119>   DW_AT_name        : ODR
    <111d>   DW_AT_decl_file   : 7
    <111e>   DW_AT_decl_line   : 273
    <1120>   DW_AT_decl_column : 17
    <1121>   DW_AT_type        : <0xfe5>
    <1125>   DW_AT_data_member_location: 20
 <2><1126>: Abbrev Number: 15 (DW_TAG_member)
